MikroElektronika/core_packages/PIC/XC8/def/PIC16F1773/mcu.h
extern volatile MD3SRCbits_t MD3SRCbits __at(0x21D);
// bitfield macros
#define _MD3SRC_MS_POSN                                     0x0
#define _MD3SRC_MS_POSITION                                 0x0
#define _MD3SRC_MS_SIZE                                     0x5
#define _MD3SRC_MS_LENGTH                                   0x5
#define _MD3SRC_MS_MASK                                     0x1F
#define _MD3SRC_MS0_POSN                                    0x0
#define _MD3SRC_MS0_POSITION                                0x0
#define _MD3SRC_MS0_SIZE                                    0x1
#define _MD3SRC_MS0_LENGTH                                  0x1
#define _MD3SRC_MS0_MASK                                    0x1
#define _MD3SRC_MS1_POSN                                    0x1
#define _MD3SRC_MS1_POSITION                                0x1
#define _MD3SRC_MS1_SIZE                                    0x1
#define _MD3SRC_MS1_LENGTH                                  0x1
#define _MD3SRC_MS1_MASK                                    0x2
#define _MD3SRC_MS2_POSN                                    0x2
#define _MD3SRC_MS2_POSITION                                0x2
#define _MD3SRC_MS2_SIZE                                    0x1
#define _MD3SRC_MS2_LENGTH                                  0x1
#define _MD3SRC_MS2_MASK                                    0x4
#define _MD3SRC_MS3_POSN                                    0x3
#define _MD3SRC_MS3_POSITION                                0x3
#define _MD3SRC_MS3_SIZE                                    0x1
#define _MD3SRC_MS3_LENGTH                                  0x1
#define _MD3SRC_MS3_MASK                                    0x8
#define _MD3SRC_MS4_POSN                                    0x4
#define _MD3SRC_MS4_POSITION                                0x4
#define _MD3SRC_MS4_SIZE                                    0x1
#define _MD3SRC_MS4_LENGTH                                  0x1
#define _MD3SRC_MS4_MASK                                    0x10
#define _MD3SRC_MD3MS_POSN                                  0x0
#define _MD3SRC_MD3MS_POSITION                              0x0
#define _MD3SRC_MD3MS_SIZE                                  0x5
#define _MD3SRC_MD3MS_LENGTH                                0x5
#define _MD3SRC_MD3MS_MASK                                  0x1F
#define _MD3SRC_MD3MS0_POSN                                 0x0
#define _MD3SRC_MD3MS0_POSITION                             0x0
#define _MD3SRC_MD3MS0_SIZE                                 0x1
#define _MD3SRC_MD3MS0_LENGTH                               0x1
#define _MD3SRC_MD3MS0_MASK                                 0x1
#define _MD3SRC_MD3MS1_POSN                                 0x1
#define _MD3SRC_MD3MS1_POSITION                             0x1
#define _MD3SRC_MD3MS1_SIZE                                 0x1
#define _MD3SRC_MD3MS1_LENGTH                               0x1
#define _MD3SRC_MD3MS1_MASK                                 0x2
#define _MD3SRC_MD3MS2_POSN                                 0x2
#define _MD3SRC_MD3MS2_POSITION                             0x2
#define _MD3SRC_MD3MS2_SIZE                                 0x1
#define _MD3SRC_MD3MS2_LENGTH                               0x1
#define _MD3SRC_MD3MS2_MASK                                 0x4
#define _MD3SRC_MD3MS3_POSN                                 0x3
#define _MD3SRC_MD3MS3_POSITION                             0x3
#define _MD3SRC_MD3MS3_SIZE                                 0x1
#define _MD3SRC_MD3MS3_LENGTH                               0x1
#define _MD3SRC_MD3MS3_MASK                                 0x8
#define _MD3SRC_MD3MS4_POSN                                 0x4
#define _MD3SRC_MD3MS4_POSITION                             0x4
#define _MD3SRC_MD3MS4_SIZE                                 0x1
#define _MD3SRC_MD3MS4_LENGTH                               0x1
#define _MD3SRC_MD3MS4_MASK                                 0x10

// Register: MD3CARL
#define MD3CARL MD3CARL
extern volatile unsigned char           MD3CARL             __at(0x21E);
#ifndef _LIB_BUILD
asm("MD3CARL equ 021Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CL                     :5;
    };
    struct {
        unsigned CL0                    :1;
        unsigned CL1                    :1;
        unsigned CL2                    :1;
        unsigned CL3                    :1;
        unsigned CL4                    :1;
    };
    struct {
        unsigned MD3CL                  :5;
    };
    struct {
        unsigned MD3CL0                 :1;
        unsigned MD3CL1                 :1;
        unsigned MD3CL2                 :1;
        unsigned MD3CL3                 :1;
        unsigned MD3CL4                 :1;
    };
} MD3CARLbits_t;
extern volatile MD3CARLbits_t MD3CARLbits __at(0x21E);
// bitfield macros
#define _MD3CARL_CL_POSN                                    0x0
#define _MD3CARL_CL_POSITION                                0x0
#define _MD3CARL_CL_SIZE                                    0x5
#define _MD3CARL_CL_LENGTH                                  0x5
#define _MD3CARL_CL_MASK                                    0x1F
#define _MD3CARL_CL0_POSN                                   0x0
#define _MD3CARL_CL0_POSITION                               0x0
#define _MD3CARL_CL0_SIZE                                   0x1
#define _MD3CARL_CL0_LENGTH                                 0x1
#define _MD3CARL_CL0_MASK                                   0x1
#define _MD3CARL_CL1_POSN                                   0x1
#define _MD3CARL_CL1_POSITION                               0x1
#define _MD3CARL_CL1_SIZE                                   0x1
#define _MD3CARL_CL1_LENGTH                                 0x1
#define _MD3CARL_CL1_MASK                                   0x2
#define _MD3CARL_CL2_POSN                                   0x2
#define _MD3CARL_CL2_POSITION                               0x2
#define _MD3CARL_CL2_SIZE                                   0x1
#define _MD3CARL_CL2_LENGTH                                 0x1
#define _MD3CARL_CL2_MASK                                   0x4
#define _MD3CARL_CL3_POSN                                   0x3
#define _MD3CARL_CL3_POSITION                               0x3
#define _MD3CARL_CL3_SIZE                                   0x1
#define _MD3CARL_CL3_LENGTH                                 0x1
#define _MD3CARL_CL3_MASK                                   0x8
#define _MD3CARL_CL4_POSN                                   0x4
#define _MD3CARL_CL4_POSITION                               0x4
#define _MD3CARL_CL4_SIZE                                   0x1
#define _MD3CARL_CL4_LENGTH                                 0x1
#define _MD3CARL_CL4_MASK                                   0x10
#define _MD3CARL_MD3CL_POSN                                 0x0
#define _MD3CARL_MD3CL_POSITION                             0x0
#define _MD3CARL_MD3CL_SIZE                                 0x5
#define _MD3CARL_MD3CL_LENGTH                               0x5
#define _MD3CARL_MD3CL_MASK                                 0x1F
#define _MD3CARL_MD3CL0_POSN                                0x0
#define _MD3CARL_MD3CL0_POSITION                            0x0
#define _MD3CARL_MD3CL0_SIZE                                0x1
#define _MD3CARL_MD3CL0_LENGTH                              0x1
#define _MD3CARL_MD3CL0_MASK                                0x1
#define _MD3CARL_MD3CL1_POSN                                0x1
#define _MD3CARL_MD3CL1_POSITION                            0x1
#define _MD3CARL_MD3CL1_SIZE                                0x1
#define _MD3CARL_MD3CL1_LENGTH                              0x1
#define _MD3CARL_MD3CL1_MASK                                0x2
#define _MD3CARL_MD3CL2_POSN                                0x2
#define _MD3CARL_MD3CL2_POSITION                            0x2
#define _MD3CARL_MD3CL2_SIZE                                0x1
#define _MD3CARL_MD3CL2_LENGTH                              0x1
#define _MD3CARL_MD3CL2_MASK                                0x4
#define _MD3CARL_MD3CL3_POSN                                0x3
#define _MD3CARL_MD3CL3_POSITION                            0x3
#define _MD3CARL_MD3CL3_SIZE                                0x1
#define _MD3CARL_MD3CL3_LENGTH                              0x1
#define _MD3CARL_MD3CL3_MASK                                0x8
#define _MD3CARL_MD3CL4_POSN                                0x4
#define _MD3CARL_MD3CL4_POSITION                            0x4
#define _MD3CARL_MD3CL4_SIZE                                0x1
#define _MD3CARL_MD3CL4_LENGTH                              0x1
#define _MD3CARL_MD3CL4_MASK                                0x10

// Register: MD3CARH
#define MD3CARH MD3CARH
extern volatile unsigned char           MD3CARH             __at(0x21F);
#ifndef _LIB_BUILD
asm("MD3CARH equ 021Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CH                     :5;
    };
    struct {
        unsigned CH0                    :1;
        unsigned CH1                    :1;
        unsigned CH2                    :1;
        unsigned CH3                    :1;
        unsigned CH4                    :1;
    };
    struct {
        unsigned MD3CH                  :5;
    };
    struct {
        unsigned MD3CH0                 :1;
        unsigned MD3CH1                 :1;
        unsigned MD3CH2                 :1;
        unsigned MD3CH3                 :1;
        unsigned MD3CH4                 :1;
    };
} MD3CARHbits_t;
extern volatile MD3CARHbits_t MD3CARHbits __at(0x21F);
// bitfield macros
#define _MD3CARH_CH_POSN                                    0x0
#define _MD3CARH_CH_POSITION                                0x0
#define _MD3CARH_CH_SIZE                                    0x5
#define _MD3CARH_CH_LENGTH                                  0x5
#define _MD3CARH_CH_MASK                                    0x1F
#define _MD3CARH_CH0_POSN                                   0x0
#define _MD3CARH_CH0_POSITION                               0x0
#define _MD3CARH_CH0_SIZE                                   0x1
#define _MD3CARH_CH0_LENGTH                                 0x1
#define _MD3CARH_CH0_MASK                                   0x1
#define _MD3CARH_CH1_POSN                                   0x1
#define _MD3CARH_CH1_POSITION                               0x1
#define _MD3CARH_CH1_SIZE                                   0x1
#define _MD3CARH_CH1_LENGTH                                 0x1
#define _MD3CARH_CH1_MASK                                   0x2
#define _MD3CARH_CH2_POSN                                   0x2
#define _MD3CARH_CH2_POSITION                               0x2
#define _MD3CARH_CH2_SIZE                                   0x1
#define _MD3CARH_CH2_LENGTH                                 0x1
#define _MD3CARH_CH2_MASK                                   0x4
#define _MD3CARH_CH3_POSN                                   0x3
#define _MD3CARH_CH3_POSITION                               0x3
#define _MD3CARH_CH3_SIZE                                   0x1
#define _MD3CARH_CH3_LENGTH                                 0x1
#define _MD3CARH_CH3_MASK                                   0x8
#define _MD3CARH_CH4_POSN                                   0x4
#define _MD3CARH_CH4_POSITION                               0x4
#define _MD3CARH_CH4_SIZE                                   0x1
#define _MD3CARH_CH4_LENGTH                                 0x1
#define _MD3CARH_CH4_MASK                                   0x10
#define _MD3CARH_MD3CH_POSN                                 0x0
#define _MD3CARH_MD3CH_POSITION                             0x0
#define _MD3CARH_MD3CH_SIZE                                 0x5
#define _MD3CARH_MD3CH_LENGTH                               0x5
#define _MD3CARH_MD3CH_MASK                                 0x1F
#define _MD3CARH_MD3CH0_POSN                                0x0
#define _MD3CARH_MD3CH0_POSITION                            0x0
#define _MD3CARH_MD3CH0_SIZE                                0x1
#define _MD3CARH_MD3CH0_LENGTH                              0x1
#define _MD3CARH_MD3CH0_MASK                                0x1
#define _MD3CARH_MD3CH1_POSN                                0x1
#define _MD3CARH_MD3CH1_POSITION                            0x1
#define _MD3CARH_MD3CH1_SIZE                                0x1
#define _MD3CARH_MD3CH1_LENGTH                              0x1
#define _MD3CARH_MD3CH1_MASK                                0x2
#define _MD3CARH_MD3CH2_POSN                                0x2
#define _MD3CARH_MD3CH2_POSITION                            0x2
#define _MD3CARH_MD3CH2_SIZE                                0x1
#define _MD3CARH_MD3CH2_LENGTH                              0x1
#define _MD3CARH_MD3CH2_MASK                                0x4
#define _MD3CARH_MD3CH3_POSN                                0x3
#define _MD3CARH_MD3CH3_POSITION                            0x3
#define _MD3CARH_MD3CH3_SIZE                                0x1
#define _MD3CARH_MD3CH3_LENGTH                              0x1
#define _MD3CARH_MD3CH3_MASK                                0x8
#define _MD3CARH_MD3CH4_POSN                                0x4
#define _MD3CARH_MD3CH4_POSITION                            0x4
#define _MD3CARH_MD3CH4_SIZE                                0x1
#define _MD3CARH_MD3CH4_LENGTH                              0x1
#define _MD3CARH_MD3CH4_MASK                                0x10

// Register: ODCONA
#define ODCONA ODCONA
extern volatile unsigned char           ODCONA              __at(0x28C);
#ifndef _LIB_BUILD
asm("ODCONA equ 028Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ODA0                   :1;
        unsigned ODA1                   :1;
        unsigned ODA2                   :1;
        unsigned ODA3                   :1;
        unsigned ODA4                   :1;
        unsigned ODA5                   :1;
        unsigned ODA6                   :1;
        unsigned ODA7                   :1;
    };
} ODCONAbits_t;
extern volatile ODCONAbits_t ODCONAbits __at(0x28C);
// bitfield macros
#define _ODCONA_ODA0_POSN                                   0x0
#define _ODCONA_ODA0_POSITION                               0x0
#define _ODCONA_ODA0_SIZE                                   0x1
#define _ODCONA_ODA0_LENGTH                                 0x1
#define _ODCONA_ODA0_MASK                                   0x1
#define _ODCONA_ODA1_POSN                                   0x1
#define _ODCONA_ODA1_POSITION                               0x1
#define _ODCONA_ODA1_SIZE                                   0x1
#define _ODCONA_ODA1_LENGTH                                 0x1
#define _ODCONA_ODA1_MASK                                   0x2
#define _ODCONA_ODA2_POSN                                   0x2
#define _ODCONA_ODA2_POSITION                               0x2
#define _ODCONA_ODA2_SIZE                                   0x1
#define _ODCONA_ODA2_LENGTH                                 0x1
#define _ODCONA_ODA2_MASK                                   0x4
#define _ODCONA_ODA3_POSN                                   0x3
#define _ODCONA_ODA3_POSITION                               0x3
#define _ODCONA_ODA3_SIZE                                   0x1
#define _ODCONA_ODA3_LENGTH                                 0x1
#define _ODCONA_ODA3_MASK                                   0x8
#define _ODCONA_ODA4_POSN                                   0x4
#define _ODCONA_ODA4_POSITION                               0x4
#define _ODCONA_ODA4_SIZE                                   0x1
#define _ODCONA_ODA4_LENGTH                                 0x1
#define _ODCONA_ODA4_MASK                                   0x10
#define _ODCONA_ODA5_POSN                                   0x5
#define _ODCONA_ODA5_POSITION                               0x5
#define _ODCONA_ODA5_SIZE                                   0x1
#define _ODCONA_ODA5_LENGTH                                 0x1
#define _ODCONA_ODA5_MASK                                   0x20
#define _ODCONA_ODA6_POSN                                   0x6
#define _ODCONA_ODA6_POSITION                               0x6
#define _ODCONA_ODA6_SIZE                                   0x1
#define _ODCONA_ODA6_LENGTH                                 0x1
#define _ODCONA_ODA6_MASK                                   0x40
#define _ODCONA_ODA7_POSN                                   0x7
#define _ODCONA_ODA7_POSITION                               0x7
#define _ODCONA_ODA7_SIZE                                   0x1
#define _ODCONA_ODA7_LENGTH                                 0x1
#define _ODCONA_ODA7_MASK                                   0x80

// Register: ODCONB
#define ODCONB ODCONB
extern volatile unsigned char           ODCONB              __at(0x28D);
#ifndef _LIB_BUILD
asm("ODCONB equ 028Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ODB0                   :1;
        unsigned ODB1                   :1;
        unsigned ODB2                   :1;
        unsigned ODB3                   :1;
        unsigned ODB4                   :1;
        unsigned ODB5                   :1;
        unsigned ODB6                   :1;
        unsigned ODB7                   :1;
    };
} ODCONBbits_t;
extern volatile ODCONBbits_t ODCONBbits __at(0x28D);
// bitfield macros
#define _ODCONB_ODB0_POSN                                   0x0
#define _ODCONB_ODB0_POSITION                               0x0
#define _ODCONB_ODB0_SIZE                                   0x1
#define _ODCONB_ODB0_LENGTH                                 0x1
#define _ODCONB_ODB0_MASK                                   0x1
#define _ODCONB_ODB1_POSN                                   0x1
#define _ODCONB_ODB1_POSITION                               0x1
#define _ODCONB_ODB1_SIZE                                   0x1
#define _ODCONB_ODB1_LENGTH                                 0x1
#define _ODCONB_ODB1_MASK                                   0x2
#define _ODCONB_ODB2_POSN                                   0x2
#define _ODCONB_ODB2_POSITION                               0x2
#define _ODCONB_ODB2_SIZE                                   0x1
#define _ODCONB_ODB2_LENGTH                                 0x1
#define _ODCONB_ODB2_MASK                                   0x4
#define _ODCONB_ODB3_POSN                                   0x3
#define _ODCONB_ODB3_POSITION                               0x3
#define _ODCONB_ODB3_SIZE                                   0x1
#define _ODCONB_ODB3_LENGTH                                 0x1
#define _ODCONB_ODB3_MASK                                   0x8
#define _ODCONB_ODB4_POSN                                   0x4
#define _ODCONB_ODB4_POSITION                               0x4
#define _ODCONB_ODB4_SIZE                                   0x1
#define _ODCONB_ODB4_LENGTH                                 0x1
#define _ODCONB_ODB4_MASK                                   0x10
#define _ODCONB_ODB5_POSN                                   0x5
#define _ODCONB_ODB5_POSITION                               0x5
#define _ODCONB_ODB5_SIZE                                   0x1
#define _ODCONB_ODB5_LENGTH                                 0x1
#define _ODCONB_ODB5_MASK                                   0x20
#define _ODCONB_ODB6_POSN                                   0x6
#define _ODCONB_ODB6_POSITION                               0x6
#define _ODCONB_ODB6_SIZE                                   0x1
#define _ODCONB_ODB6_LENGTH                                 0x1
#define _ODCONB_ODB6_MASK                                   0x40
#define _ODCONB_ODB7_POSN                                   0x7
#define _ODCONB_ODB7_POSITION                               0x7
#define _ODCONB_ODB7_SIZE                                   0x1
#define _ODCONB_ODB7_LENGTH                                 0x1
#define _ODCONB_ODB7_MASK                                   0x80

// Register: ODCONC
#define ODCONC ODCONC
extern volatile unsigned char           ODCONC              __at(0x28E);
#ifndef _LIB_BUILD
asm("ODCONC equ 028Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ODC0                   :1;
        unsigned ODC1                   :1;
        unsigned ODC2                   :1;
        unsigned ODC3                   :1;
        unsigned ODC4                   :1;
        unsigned ODC5                   :1;
        unsigned ODC6                   :1;
        unsigned ODC7                   :1;
    };
} ODCONCbits_t;
