MikroElektronika/core_packages/PIC/XC8/def/PIC16F1773/mcu.h
// Register: DAC1REFL
#define DAC1REFL DAC1REFL
extern volatile unsigned char           DAC1REFL            __at(0x58F);
#ifndef _LIB_BUILD
asm("DAC1REFL equ 058Fh");
#endif
// aliases
extern volatile unsigned char           DAC1CON1            __at(0x58F);
#ifndef _LIB_BUILD
asm("DAC1CON1 equ 058Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned REF                    :8;
    };
    struct {
        unsigned DAC1REF0               :1;
        unsigned DAC1REF1               :1;
        unsigned DAC1REF2               :1;
        unsigned DAC1REF3               :1;
        unsigned DAC1REF4               :1;
        unsigned DAC1REF5               :1;
        unsigned DAC1REF6               :1;
        unsigned DAC1REF7               :1;
    };
    struct {
        unsigned R0                     :1;
        unsigned R1                     :1;
        unsigned R2                     :1;
        unsigned R3                     :1;
        unsigned R4                     :1;
        unsigned R5                     :1;
        unsigned R6                     :1;
        unsigned R7                     :1;
    };
    struct {
        unsigned DAC1R0                 :1;
        unsigned DAC1R1                 :1;
        unsigned DAC1R2                 :1;
        unsigned DAC1R3                 :1;
        unsigned DAC1R4                 :1;
        unsigned DAC1R5                 :1;
        unsigned DAC1R6                 :1;
        unsigned DAC1R7                 :1;
    };
    struct {
        unsigned REF0                   :1;
        unsigned REF1                   :1;
        unsigned REF2                   :1;
        unsigned REF3                   :1;
        unsigned REF4                   :1;
        unsigned REF5                   :1;
        unsigned REF6                   :1;
        unsigned REF7                   :1;
    };
} DAC1REFLbits_t;
extern volatile DAC1REFLbits_t DAC1REFLbits __at(0x58F);
// bitfield macros
#define _DAC1REFL_REF_POSN                                  0x0
#define _DAC1REFL_REF_POSITION                              0x0
#define _DAC1REFL_REF_SIZE                                  0x8
#define _DAC1REFL_REF_LENGTH                                0x8
#define _DAC1REFL_REF_MASK                                  0xFF
#define _DAC1REFL_DAC1REF0_POSN                             0x0
#define _DAC1REFL_DAC1REF0_POSITION                         0x0
#define _DAC1REFL_DAC1REF0_SIZE                             0x1
#define _DAC1REFL_DAC1REF0_LENGTH                           0x1
#define _DAC1REFL_DAC1REF0_MASK                             0x1
#define _DAC1REFL_DAC1REF1_POSN                             0x1
#define _DAC1REFL_DAC1REF1_POSITION                         0x1
#define _DAC1REFL_DAC1REF1_SIZE                             0x1
#define _DAC1REFL_DAC1REF1_LENGTH                           0x1
#define _DAC1REFL_DAC1REF1_MASK                             0x2
#define _DAC1REFL_DAC1REF2_POSN                             0x2
#define _DAC1REFL_DAC1REF2_POSITION                         0x2
#define _DAC1REFL_DAC1REF2_SIZE                             0x1
#define _DAC1REFL_DAC1REF2_LENGTH                           0x1
#define _DAC1REFL_DAC1REF2_MASK                             0x4
#define _DAC1REFL_DAC1REF3_POSN                             0x3
#define _DAC1REFL_DAC1REF3_POSITION                         0x3
#define _DAC1REFL_DAC1REF3_SIZE                             0x1
#define _DAC1REFL_DAC1REF3_LENGTH                           0x1
#define _DAC1REFL_DAC1REF3_MASK                             0x8
#define _DAC1REFL_DAC1REF4_POSN                             0x4
#define _DAC1REFL_DAC1REF4_POSITION                         0x4
#define _DAC1REFL_DAC1REF4_SIZE                             0x1
#define _DAC1REFL_DAC1REF4_LENGTH                           0x1
#define _DAC1REFL_DAC1REF4_MASK                             0x10
#define _DAC1REFL_DAC1REF5_POSN                             0x5
#define _DAC1REFL_DAC1REF5_POSITION                         0x5
#define _DAC1REFL_DAC1REF5_SIZE                             0x1
#define _DAC1REFL_DAC1REF5_LENGTH                           0x1
#define _DAC1REFL_DAC1REF5_MASK                             0x20
#define _DAC1REFL_DAC1REF6_POSN                             0x6
#define _DAC1REFL_DAC1REF6_POSITION                         0x6
#define _DAC1REFL_DAC1REF6_SIZE                             0x1
#define _DAC1REFL_DAC1REF6_LENGTH                           0x1
#define _DAC1REFL_DAC1REF6_MASK                             0x40
#define _DAC1REFL_DAC1REF7_POSN                             0x7
#define _DAC1REFL_DAC1REF7_POSITION                         0x7
#define _DAC1REFL_DAC1REF7_SIZE                             0x1
#define _DAC1REFL_DAC1REF7_LENGTH                           0x1
#define _DAC1REFL_DAC1REF7_MASK                             0x80
#define _DAC1REFL_R0_POSN                                   0x0
#define _DAC1REFL_R0_POSITION                               0x0
#define _DAC1REFL_R0_SIZE                                   0x1
#define _DAC1REFL_R0_LENGTH                                 0x1
#define _DAC1REFL_R0_MASK                                   0x1
#define _DAC1REFL_R1_POSN                                   0x1
#define _DAC1REFL_R1_POSITION                               0x1
#define _DAC1REFL_R1_SIZE                                   0x1
#define _DAC1REFL_R1_LENGTH                                 0x1
#define _DAC1REFL_R1_MASK                                   0x2
#define _DAC1REFL_R2_POSN                                   0x2
#define _DAC1REFL_R2_POSITION                               0x2
#define _DAC1REFL_R2_SIZE                                   0x1
#define _DAC1REFL_R2_LENGTH                                 0x1
#define _DAC1REFL_R2_MASK                                   0x4
#define _DAC1REFL_R3_POSN                                   0x3
#define _DAC1REFL_R3_POSITION                               0x3
#define _DAC1REFL_R3_SIZE                                   0x1
#define _DAC1REFL_R3_LENGTH                                 0x1
#define _DAC1REFL_R3_MASK                                   0x8
#define _DAC1REFL_R4_POSN                                   0x4
#define _DAC1REFL_R4_POSITION                               0x4
#define _DAC1REFL_R4_SIZE                                   0x1
#define _DAC1REFL_R4_LENGTH                                 0x1
#define _DAC1REFL_R4_MASK                                   0x10
#define _DAC1REFL_R5_POSN                                   0x5
#define _DAC1REFL_R5_POSITION                               0x5
#define _DAC1REFL_R5_SIZE                                   0x1
#define _DAC1REFL_R5_LENGTH                                 0x1
#define _DAC1REFL_R5_MASK                                   0x20
#define _DAC1REFL_R6_POSN                                   0x6
#define _DAC1REFL_R6_POSITION                               0x6
#define _DAC1REFL_R6_SIZE                                   0x1
#define _DAC1REFL_R6_LENGTH                                 0x1
#define _DAC1REFL_R6_MASK                                   0x40
#define _DAC1REFL_R7_POSN                                   0x7
#define _DAC1REFL_R7_POSITION                               0x7
#define _DAC1REFL_R7_SIZE                                   0x1
#define _DAC1REFL_R7_LENGTH                                 0x1
#define _DAC1REFL_R7_MASK                                   0x80
#define _DAC1REFL_DAC1R0_POSN                               0x0
#define _DAC1REFL_DAC1R0_POSITION                           0x0
#define _DAC1REFL_DAC1R0_SIZE                               0x1
#define _DAC1REFL_DAC1R0_LENGTH                             0x1
#define _DAC1REFL_DAC1R0_MASK                               0x1
#define _DAC1REFL_DAC1R1_POSN                               0x1
#define _DAC1REFL_DAC1R1_POSITION                           0x1
#define _DAC1REFL_DAC1R1_SIZE                               0x1
#define _DAC1REFL_DAC1R1_LENGTH                             0x1
#define _DAC1REFL_DAC1R1_MASK                               0x2
#define _DAC1REFL_DAC1R2_POSN                               0x2
#define _DAC1REFL_DAC1R2_POSITION                           0x2
#define _DAC1REFL_DAC1R2_SIZE                               0x1
#define _DAC1REFL_DAC1R2_LENGTH                             0x1
#define _DAC1REFL_DAC1R2_MASK                               0x4
#define _DAC1REFL_DAC1R3_POSN                               0x3
#define _DAC1REFL_DAC1R3_POSITION                           0x3
#define _DAC1REFL_DAC1R3_SIZE                               0x1
#define _DAC1REFL_DAC1R3_LENGTH                             0x1
#define _DAC1REFL_DAC1R3_MASK                               0x8
#define _DAC1REFL_DAC1R4_POSN                               0x4
#define _DAC1REFL_DAC1R4_POSITION                           0x4
#define _DAC1REFL_DAC1R4_SIZE                               0x1
#define _DAC1REFL_DAC1R4_LENGTH                             0x1
#define _DAC1REFL_DAC1R4_MASK                               0x10
#define _DAC1REFL_DAC1R5_POSN                               0x5
#define _DAC1REFL_DAC1R5_POSITION                           0x5
#define _DAC1REFL_DAC1R5_SIZE                               0x1
#define _DAC1REFL_DAC1R5_LENGTH                             0x1
#define _DAC1REFL_DAC1R5_MASK                               0x20
#define _DAC1REFL_DAC1R6_POSN                               0x6
#define _DAC1REFL_DAC1R6_POSITION                           0x6
#define _DAC1REFL_DAC1R6_SIZE                               0x1
#define _DAC1REFL_DAC1R6_LENGTH                             0x1
#define _DAC1REFL_DAC1R6_MASK                               0x40
#define _DAC1REFL_DAC1R7_POSN                               0x7
#define _DAC1REFL_DAC1R7_POSITION                           0x7
#define _DAC1REFL_DAC1R7_SIZE                               0x1
#define _DAC1REFL_DAC1R7_LENGTH                             0x1
#define _DAC1REFL_DAC1R7_MASK                               0x80
#define _DAC1REFL_REF0_POSN                                 0x0
#define _DAC1REFL_REF0_POSITION                             0x0
#define _DAC1REFL_REF0_SIZE                                 0x1
#define _DAC1REFL_REF0_LENGTH                               0x1
#define _DAC1REFL_REF0_MASK                                 0x1
#define _DAC1REFL_REF1_POSN                                 0x1
#define _DAC1REFL_REF1_POSITION                             0x1
#define _DAC1REFL_REF1_SIZE                                 0x1
#define _DAC1REFL_REF1_LENGTH                               0x1
#define _DAC1REFL_REF1_MASK                                 0x2
#define _DAC1REFL_REF2_POSN                                 0x2
#define _DAC1REFL_REF2_POSITION                             0x2
#define _DAC1REFL_REF2_SIZE                                 0x1
#define _DAC1REFL_REF2_LENGTH                               0x1
#define _DAC1REFL_REF2_MASK                                 0x4
#define _DAC1REFL_REF3_POSN                                 0x3
#define _DAC1REFL_REF3_POSITION                             0x3
#define _DAC1REFL_REF3_SIZE                                 0x1
#define _DAC1REFL_REF3_LENGTH                               0x1
#define _DAC1REFL_REF3_MASK                                 0x8
#define _DAC1REFL_REF4_POSN                                 0x4
#define _DAC1REFL_REF4_POSITION                             0x4
#define _DAC1REFL_REF4_SIZE                                 0x1
#define _DAC1REFL_REF4_LENGTH                               0x1
#define _DAC1REFL_REF4_MASK                                 0x10
#define _DAC1REFL_REF5_POSN                                 0x5
#define _DAC1REFL_REF5_POSITION                             0x5
#define _DAC1REFL_REF5_SIZE                                 0x1
#define _DAC1REFL_REF5_LENGTH                               0x1
#define _DAC1REFL_REF5_MASK                                 0x20
#define _DAC1REFL_REF6_POSN                                 0x6
#define _DAC1REFL_REF6_POSITION                             0x6
#define _DAC1REFL_REF6_SIZE                                 0x1
#define _DAC1REFL_REF6_LENGTH                               0x1
#define _DAC1REFL_REF6_MASK                                 0x40
#define _DAC1REFL_REF7_POSN                                 0x7
#define _DAC1REFL_REF7_POSITION                             0x7
#define _DAC1REFL_REF7_SIZE                                 0x1
#define _DAC1REFL_REF7_LENGTH                               0x1
#define _DAC1REFL_REF7_MASK                                 0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned REF                    :8;
    };
    struct {
        unsigned DAC1REF0               :1;
        unsigned DAC1REF1               :1;
        unsigned DAC1REF2               :1;
        unsigned DAC1REF3               :1;
        unsigned DAC1REF4               :1;
        unsigned DAC1REF5               :1;
        unsigned DAC1REF6               :1;
        unsigned DAC1REF7               :1;
    };
    struct {
        unsigned R0                     :1;
        unsigned R1                     :1;
        unsigned R2                     :1;
        unsigned R3                     :1;
        unsigned R4                     :1;
        unsigned R5                     :1;
        unsigned R6                     :1;
        unsigned R7                     :1;
    };
    struct {
        unsigned DAC1R0                 :1;
        unsigned DAC1R1                 :1;
        unsigned DAC1R2                 :1;
        unsigned DAC1R3                 :1;
        unsigned DAC1R4                 :1;
        unsigned DAC1R5                 :1;
        unsigned DAC1R6                 :1;
        unsigned DAC1R7                 :1;
    };
    struct {
        unsigned REF0                   :1;
        unsigned REF1                   :1;
        unsigned REF2                   :1;
        unsigned REF3                   :1;
        unsigned REF4                   :1;
        unsigned REF5                   :1;
        unsigned REF6                   :1;
        unsigned REF7                   :1;
    };
} DAC1CON1bits_t;
