MikroElektronika/core_packages/PIC/XC8/def/PIC16F1773/mcu.h
// Register: DAC3CON0
#define DAC3CON0 DAC3CON0
extern volatile unsigned char           DAC3CON0            __at(0x594);
#ifndef _LIB_BUILD
asm("DAC3CON0 equ 0594h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NSS                    :2;
        unsigned PSS                    :2;
        unsigned OE2                    :1;
        unsigned OE1                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned NSS0                   :1;
        unsigned NSS1                   :1;
        unsigned PSS0                   :1;
        unsigned PSS1                   :1;
    };
    struct {
        unsigned DACNSS                 :2;
        unsigned DACPSS                 :2;
        unsigned DACOE2                 :1;
        unsigned DACOE1                 :1;
        unsigned                        :1;
        unsigned DACEN                  :1;
    };
    struct {
        unsigned DACNSS0                :1;
        unsigned DACNSS1                :1;
        unsigned DACPSS0                :1;
        unsigned DACPSS1                :1;
    };
    struct {
        unsigned DAC3NSS                :2;
        unsigned DAC3PSS                :2;
        unsigned DAC3OE2                :1;
        unsigned DAC3OE1                :1;
        unsigned                        :1;
        unsigned DAC3EN                 :1;
    };
    struct {
        unsigned DAC3NSS0               :1;
        unsigned DAC3NSS1               :1;
        unsigned DAC3PSS0               :1;
        unsigned DAC3PSS1               :1;
    };
} DAC3CON0bits_t;
extern volatile DAC3CON0bits_t DAC3CON0bits __at(0x594);
// bitfield macros
#define _DAC3CON0_NSS_POSN                                  0x0
#define _DAC3CON0_NSS_POSITION                              0x0
#define _DAC3CON0_NSS_SIZE                                  0x2
#define _DAC3CON0_NSS_LENGTH                                0x2
#define _DAC3CON0_NSS_MASK                                  0x3
#define _DAC3CON0_PSS_POSN                                  0x2
#define _DAC3CON0_PSS_POSITION                              0x2
#define _DAC3CON0_PSS_SIZE                                  0x2
#define _DAC3CON0_PSS_LENGTH                                0x2
#define _DAC3CON0_PSS_MASK                                  0xC
#define _DAC3CON0_OE2_POSN                                  0x4
#define _DAC3CON0_OE2_POSITION                              0x4
#define _DAC3CON0_OE2_SIZE                                  0x1
#define _DAC3CON0_OE2_LENGTH                                0x1
#define _DAC3CON0_OE2_MASK                                  0x10
#define _DAC3CON0_OE1_POSN                                  0x5
#define _DAC3CON0_OE1_POSITION                              0x5
#define _DAC3CON0_OE1_SIZE                                  0x1
#define _DAC3CON0_OE1_LENGTH                                0x1
#define _DAC3CON0_OE1_MASK                                  0x20
#define _DAC3CON0_EN_POSN                                   0x7
#define _DAC3CON0_EN_POSITION                               0x7
#define _DAC3CON0_EN_SIZE                                   0x1
#define _DAC3CON0_EN_LENGTH                                 0x1
#define _DAC3CON0_EN_MASK                                   0x80
#define _DAC3CON0_NSS0_POSN                                 0x0
#define _DAC3CON0_NSS0_POSITION                             0x0
#define _DAC3CON0_NSS0_SIZE                                 0x1
#define _DAC3CON0_NSS0_LENGTH                               0x1
#define _DAC3CON0_NSS0_MASK                                 0x1
#define _DAC3CON0_NSS1_POSN                                 0x1
#define _DAC3CON0_NSS1_POSITION                             0x1
#define _DAC3CON0_NSS1_SIZE                                 0x1
#define _DAC3CON0_NSS1_LENGTH                               0x1
#define _DAC3CON0_NSS1_MASK                                 0x2
#define _DAC3CON0_PSS0_POSN                                 0x2
#define _DAC3CON0_PSS0_POSITION                             0x2
#define _DAC3CON0_PSS0_SIZE                                 0x1
#define _DAC3CON0_PSS0_LENGTH                               0x1
#define _DAC3CON0_PSS0_MASK                                 0x4
#define _DAC3CON0_PSS1_POSN                                 0x3
#define _DAC3CON0_PSS1_POSITION                             0x3
#define _DAC3CON0_PSS1_SIZE                                 0x1
#define _DAC3CON0_PSS1_LENGTH                               0x1
#define _DAC3CON0_PSS1_MASK                                 0x8
#define _DAC3CON0_DACNSS_POSN                               0x0
#define _DAC3CON0_DACNSS_POSITION                           0x0
#define _DAC3CON0_DACNSS_SIZE                               0x2
#define _DAC3CON0_DACNSS_LENGTH                             0x2
#define _DAC3CON0_DACNSS_MASK                               0x3
#define _DAC3CON0_DACPSS_POSN                               0x2
#define _DAC3CON0_DACPSS_POSITION                           0x2
#define _DAC3CON0_DACPSS_SIZE                               0x2
#define _DAC3CON0_DACPSS_LENGTH                             0x2
#define _DAC3CON0_DACPSS_MASK                               0xC
#define _DAC3CON0_DACOE2_POSN                               0x4
#define _DAC3CON0_DACOE2_POSITION                           0x4
#define _DAC3CON0_DACOE2_SIZE                               0x1
#define _DAC3CON0_DACOE2_LENGTH                             0x1
#define _DAC3CON0_DACOE2_MASK                               0x10
#define _DAC3CON0_DACOE1_POSN                               0x5
#define _DAC3CON0_DACOE1_POSITION                           0x5
#define _DAC3CON0_DACOE1_SIZE                               0x1
#define _DAC3CON0_DACOE1_LENGTH                             0x1
#define _DAC3CON0_DACOE1_MASK                               0x20
#define _DAC3CON0_DACEN_POSN                                0x7
#define _DAC3CON0_DACEN_POSITION                            0x7
#define _DAC3CON0_DACEN_SIZE                                0x1
#define _DAC3CON0_DACEN_LENGTH                              0x1
#define _DAC3CON0_DACEN_MASK                                0x80
#define _DAC3CON0_DACNSS0_POSN                              0x0
#define _DAC3CON0_DACNSS0_POSITION                          0x0
#define _DAC3CON0_DACNSS0_SIZE                              0x1
#define _DAC3CON0_DACNSS0_LENGTH                            0x1
#define _DAC3CON0_DACNSS0_MASK                              0x1
#define _DAC3CON0_DACNSS1_POSN                              0x1
#define _DAC3CON0_DACNSS1_POSITION                          0x1
#define _DAC3CON0_DACNSS1_SIZE                              0x1
#define _DAC3CON0_DACNSS1_LENGTH                            0x1
#define _DAC3CON0_DACNSS1_MASK                              0x2
#define _DAC3CON0_DACPSS0_POSN                              0x2
#define _DAC3CON0_DACPSS0_POSITION                          0x2
#define _DAC3CON0_DACPSS0_SIZE                              0x1
#define _DAC3CON0_DACPSS0_LENGTH                            0x1
#define _DAC3CON0_DACPSS0_MASK                              0x4
#define _DAC3CON0_DACPSS1_POSN                              0x3
#define _DAC3CON0_DACPSS1_POSITION                          0x3
#define _DAC3CON0_DACPSS1_SIZE                              0x1
#define _DAC3CON0_DACPSS1_LENGTH                            0x1
#define _DAC3CON0_DACPSS1_MASK                              0x8
#define _DAC3CON0_DAC3NSS_POSN                              0x0
#define _DAC3CON0_DAC3NSS_POSITION                          0x0
#define _DAC3CON0_DAC3NSS_SIZE                              0x2
#define _DAC3CON0_DAC3NSS_LENGTH                            0x2
#define _DAC3CON0_DAC3NSS_MASK                              0x3
#define _DAC3CON0_DAC3PSS_POSN                              0x2
#define _DAC3CON0_DAC3PSS_POSITION                          0x2
#define _DAC3CON0_DAC3PSS_SIZE                              0x2
#define _DAC3CON0_DAC3PSS_LENGTH                            0x2
#define _DAC3CON0_DAC3PSS_MASK                              0xC
#define _DAC3CON0_DAC3OE2_POSN                              0x4
#define _DAC3CON0_DAC3OE2_POSITION                          0x4
#define _DAC3CON0_DAC3OE2_SIZE                              0x1
#define _DAC3CON0_DAC3OE2_LENGTH                            0x1
#define _DAC3CON0_DAC3OE2_MASK                              0x10
#define _DAC3CON0_DAC3OE1_POSN                              0x5
#define _DAC3CON0_DAC3OE1_POSITION                          0x5
#define _DAC3CON0_DAC3OE1_SIZE                              0x1
#define _DAC3CON0_DAC3OE1_LENGTH                            0x1
#define _DAC3CON0_DAC3OE1_MASK                              0x20
#define _DAC3CON0_DAC3EN_POSN                               0x7
#define _DAC3CON0_DAC3EN_POSITION                           0x7
#define _DAC3CON0_DAC3EN_SIZE                               0x1
#define _DAC3CON0_DAC3EN_LENGTH                             0x1
#define _DAC3CON0_DAC3EN_MASK                               0x80
#define _DAC3CON0_DAC3NSS0_POSN                             0x0
#define _DAC3CON0_DAC3NSS0_POSITION                         0x0
#define _DAC3CON0_DAC3NSS0_SIZE                             0x1
#define _DAC3CON0_DAC3NSS0_LENGTH                           0x1
#define _DAC3CON0_DAC3NSS0_MASK                             0x1
#define _DAC3CON0_DAC3NSS1_POSN                             0x1
#define _DAC3CON0_DAC3NSS1_POSITION                         0x1
#define _DAC3CON0_DAC3NSS1_SIZE                             0x1
#define _DAC3CON0_DAC3NSS1_LENGTH                           0x1
#define _DAC3CON0_DAC3NSS1_MASK                             0x2
#define _DAC3CON0_DAC3PSS0_POSN                             0x2
#define _DAC3CON0_DAC3PSS0_POSITION                         0x2
#define _DAC3CON0_DAC3PSS0_SIZE                             0x1
#define _DAC3CON0_DAC3PSS0_LENGTH                           0x1
#define _DAC3CON0_DAC3PSS0_MASK                             0x4
#define _DAC3CON0_DAC3PSS1_POSN                             0x3
#define _DAC3CON0_DAC3PSS1_POSITION                         0x3
#define _DAC3CON0_DAC3PSS1_SIZE                             0x1
#define _DAC3CON0_DAC3PSS1_LENGTH                           0x1
#define _DAC3CON0_DAC3PSS1_MASK                             0x8

