MikroElektronika/core_packages/PIC/XC8/def/PIC16F1773/mcu.h
extern volatile PWM9DCHbits_t PWM9DCHbits __at(0x61B);
// bitfield macros
#define _PWM9DCH_DC_POSN                                    0x0
#define _PWM9DCH_DC_POSITION                                0x0
#define _PWM9DCH_DC_SIZE                                    0x8
#define _PWM9DCH_DC_LENGTH                                  0x8
#define _PWM9DCH_DC_MASK                                    0xFF
#define _PWM9DCH_DC2_POSN                                   0x0
#define _PWM9DCH_DC2_POSITION                               0x0
#define _PWM9DCH_DC2_SIZE                                   0x1
#define _PWM9DCH_DC2_LENGTH                                 0x1
#define _PWM9DCH_DC2_MASK                                   0x1
#define _PWM9DCH_DC3_POSN                                   0x1
#define _PWM9DCH_DC3_POSITION                               0x1
#define _PWM9DCH_DC3_SIZE                                   0x1
#define _PWM9DCH_DC3_LENGTH                                 0x1
#define _PWM9DCH_DC3_MASK                                   0x2
#define _PWM9DCH_DC4_POSN                                   0x2
#define _PWM9DCH_DC4_POSITION                               0x2
#define _PWM9DCH_DC4_SIZE                                   0x1
#define _PWM9DCH_DC4_LENGTH                                 0x1
#define _PWM9DCH_DC4_MASK                                   0x4
#define _PWM9DCH_DC5_POSN                                   0x3
#define _PWM9DCH_DC5_POSITION                               0x3
#define _PWM9DCH_DC5_SIZE                                   0x1
#define _PWM9DCH_DC5_LENGTH                                 0x1
#define _PWM9DCH_DC5_MASK                                   0x8
#define _PWM9DCH_DC6_POSN                                   0x4
#define _PWM9DCH_DC6_POSITION                               0x4
#define _PWM9DCH_DC6_SIZE                                   0x1
#define _PWM9DCH_DC6_LENGTH                                 0x1
#define _PWM9DCH_DC6_MASK                                   0x10
#define _PWM9DCH_DC7_POSN                                   0x5
#define _PWM9DCH_DC7_POSITION                               0x5
#define _PWM9DCH_DC7_SIZE                                   0x1
#define _PWM9DCH_DC7_LENGTH                                 0x1
#define _PWM9DCH_DC7_MASK                                   0x20
#define _PWM9DCH_DC8_POSN                                   0x6
#define _PWM9DCH_DC8_POSITION                               0x6
#define _PWM9DCH_DC8_SIZE                                   0x1
#define _PWM9DCH_DC8_LENGTH                                 0x1
#define _PWM9DCH_DC8_MASK                                   0x40
#define _PWM9DCH_DC9_POSN                                   0x7
#define _PWM9DCH_DC9_POSITION                               0x7
#define _PWM9DCH_DC9_SIZE                                   0x1
#define _PWM9DCH_DC9_LENGTH                                 0x1
#define _PWM9DCH_DC9_MASK                                   0x80
#define _PWM9DCH_PWM9DC2_POSN                               0x0
#define _PWM9DCH_PWM9DC2_POSITION                           0x0
#define _PWM9DCH_PWM9DC2_SIZE                               0x1
#define _PWM9DCH_PWM9DC2_LENGTH                             0x1
#define _PWM9DCH_PWM9DC2_MASK                               0x1
#define _PWM9DCH_PWM9DC3_POSN                               0x1
#define _PWM9DCH_PWM9DC3_POSITION                           0x1
#define _PWM9DCH_PWM9DC3_SIZE                               0x1
#define _PWM9DCH_PWM9DC3_LENGTH                             0x1
#define _PWM9DCH_PWM9DC3_MASK                               0x2
#define _PWM9DCH_PWM9DC4_POSN                               0x2
#define _PWM9DCH_PWM9DC4_POSITION                           0x2
#define _PWM9DCH_PWM9DC4_SIZE                               0x1
#define _PWM9DCH_PWM9DC4_LENGTH                             0x1
#define _PWM9DCH_PWM9DC4_MASK                               0x4
#define _PWM9DCH_PWM9DC5_POSN                               0x3
#define _PWM9DCH_PWM9DC5_POSITION                           0x3
#define _PWM9DCH_PWM9DC5_SIZE                               0x1
#define _PWM9DCH_PWM9DC5_LENGTH                             0x1
#define _PWM9DCH_PWM9DC5_MASK                               0x8
#define _PWM9DCH_PWM9DC6_POSN                               0x4
#define _PWM9DCH_PWM9DC6_POSITION                           0x4
#define _PWM9DCH_PWM9DC6_SIZE                               0x1
#define _PWM9DCH_PWM9DC6_LENGTH                             0x1
#define _PWM9DCH_PWM9DC6_MASK                               0x10
#define _PWM9DCH_PWM9DC7_POSN                               0x5
#define _PWM9DCH_PWM9DC7_POSITION                           0x5
#define _PWM9DCH_PWM9DC7_SIZE                               0x1
#define _PWM9DCH_PWM9DC7_LENGTH                             0x1
#define _PWM9DCH_PWM9DC7_MASK                               0x20
#define _PWM9DCH_PWM9DC8_POSN                               0x6
#define _PWM9DCH_PWM9DC8_POSITION                           0x6
#define _PWM9DCH_PWM9DC8_SIZE                               0x1
#define _PWM9DCH_PWM9DC8_LENGTH                             0x1
#define _PWM9DCH_PWM9DC8_MASK                               0x40
#define _PWM9DCH_PWM9DC9_POSN                               0x7
#define _PWM9DCH_PWM9DC9_POSITION                           0x7
#define _PWM9DCH_PWM9DC9_SIZE                               0x1
#define _PWM9DCH_PWM9DC9_LENGTH                             0x1
#define _PWM9DCH_PWM9DC9_MASK                               0x80
#define _PWM9DCH_PWMPW2_POSN                                0x0
#define _PWM9DCH_PWMPW2_POSITION                            0x0
#define _PWM9DCH_PWMPW2_SIZE                                0x1
#define _PWM9DCH_PWMPW2_LENGTH                              0x1
#define _PWM9DCH_PWMPW2_MASK                                0x1
#define _PWM9DCH_PWMPW3_POSN                                0x1
#define _PWM9DCH_PWMPW3_POSITION                            0x1
#define _PWM9DCH_PWMPW3_SIZE                                0x1
#define _PWM9DCH_PWMPW3_LENGTH                              0x1
#define _PWM9DCH_PWMPW3_MASK                                0x2
#define _PWM9DCH_PWMPW4_POSN                                0x2
#define _PWM9DCH_PWMPW4_POSITION                            0x2
#define _PWM9DCH_PWMPW4_SIZE                                0x1
#define _PWM9DCH_PWMPW4_LENGTH                              0x1
#define _PWM9DCH_PWMPW4_MASK                                0x4
#define _PWM9DCH_PWMPW5_POSN                                0x3
#define _PWM9DCH_PWMPW5_POSITION                            0x3
#define _PWM9DCH_PWMPW5_SIZE                                0x1
#define _PWM9DCH_PWMPW5_LENGTH                              0x1
#define _PWM9DCH_PWMPW5_MASK                                0x8
#define _PWM9DCH_PWMPW6_POSN                                0x4
#define _PWM9DCH_PWMPW6_POSITION                            0x4
#define _PWM9DCH_PWMPW6_SIZE                                0x1
#define _PWM9DCH_PWMPW6_LENGTH                              0x1
#define _PWM9DCH_PWMPW6_MASK                                0x10
#define _PWM9DCH_PWMPW7_POSN                                0x5
#define _PWM9DCH_PWMPW7_POSITION                            0x5
#define _PWM9DCH_PWMPW7_SIZE                                0x1
#define _PWM9DCH_PWMPW7_LENGTH                              0x1
#define _PWM9DCH_PWMPW7_MASK                                0x20
#define _PWM9DCH_PWMPW8_POSN                                0x6
#define _PWM9DCH_PWMPW8_POSITION                            0x6
#define _PWM9DCH_PWMPW8_SIZE                                0x1
#define _PWM9DCH_PWMPW8_LENGTH                              0x1
#define _PWM9DCH_PWMPW8_MASK                                0x40
#define _PWM9DCH_PWMPW9_POSN                                0x7
#define _PWM9DCH_PWMPW9_POSITION                            0x7
#define _PWM9DCH_PWMPW9_SIZE                                0x1
#define _PWM9DCH_PWMPW9_LENGTH                              0x1
#define _PWM9DCH_PWMPW9_MASK                                0x80

// Register: PWM9CON
#define PWM9CON PWM9CON
extern volatile unsigned char           PWM9CON             __at(0x61C);
#ifndef _LIB_BUILD
asm("PWM9CON equ 061Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned OE                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :4;
        unsigned PWM9POL                :1;
        unsigned PWM9OUT                :1;
        unsigned PWM9OE                 :1;
        unsigned PWM9EN                 :1;
    };
} PWM9CONbits_t;
extern volatile PWM9CONbits_t PWM9CONbits __at(0x61C);
// bitfield macros
#define _PWM9CON_POL_POSN                                   0x4
#define _PWM9CON_POL_POSITION                               0x4
#define _PWM9CON_POL_SIZE                                   0x1
#define _PWM9CON_POL_LENGTH                                 0x1
#define _PWM9CON_POL_MASK                                   0x10
#define _PWM9CON_OUT_POSN                                   0x5
#define _PWM9CON_OUT_POSITION                               0x5
#define _PWM9CON_OUT_SIZE                                   0x1
#define _PWM9CON_OUT_LENGTH                                 0x1
#define _PWM9CON_OUT_MASK                                   0x20
#define _PWM9CON_OE_POSN                                    0x6
#define _PWM9CON_OE_POSITION                                0x6
#define _PWM9CON_OE_SIZE                                    0x1
#define _PWM9CON_OE_LENGTH                                  0x1
#define _PWM9CON_OE_MASK                                    0x40
#define _PWM9CON_EN_POSN                                    0x7
#define _PWM9CON_EN_POSITION                                0x7
#define _PWM9CON_EN_SIZE                                    0x1
#define _PWM9CON_EN_LENGTH                                  0x1
#define _PWM9CON_EN_MASK                                    0x80
#define _PWM9CON_PWM9POL_POSN                               0x4
#define _PWM9CON_PWM9POL_POSITION                           0x4
#define _PWM9CON_PWM9POL_SIZE                               0x1
#define _PWM9CON_PWM9POL_LENGTH                             0x1
#define _PWM9CON_PWM9POL_MASK                               0x10
#define _PWM9CON_PWM9OUT_POSN                               0x5
#define _PWM9CON_PWM9OUT_POSITION                           0x5
#define _PWM9CON_PWM9OUT_SIZE                               0x1
#define _PWM9CON_PWM9OUT_LENGTH                             0x1
#define _PWM9CON_PWM9OUT_MASK                               0x20
#define _PWM9CON_PWM9OE_POSN                                0x6
#define _PWM9CON_PWM9OE_POSITION                            0x6
#define _PWM9CON_PWM9OE_SIZE                                0x1
#define _PWM9CON_PWM9OE_LENGTH                              0x1
#define _PWM9CON_PWM9OE_MASK                                0x40
#define _PWM9CON_PWM9EN_POSN                                0x7
#define _PWM9CON_PWM9EN_POSITION                            0x7
#define _PWM9CON_PWM9EN_SIZE                                0x1
#define _PWM9CON_PWM9EN_LENGTH                              0x1
#define _PWM9CON_PWM9EN_MASK                                0x80

// Register: COG1PHR
#define COG1PHR COG1PHR
extern volatile unsigned char           COG1PHR             __at(0x68D);
#ifndef _LIB_BUILD
asm("COG1PHR equ 068Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PHR                    :6;
    };
    struct {
        unsigned PHR0                   :1;
        unsigned PHR1                   :1;
        unsigned PHR2                   :1;
        unsigned PHR3                   :1;
        unsigned PHR4                   :1;
        unsigned PHR5                   :1;
    };
    struct {
        unsigned G1PHR0                 :1;
        unsigned G1PHR1                 :1;
        unsigned G1PHR2                 :1;
        unsigned G1PHR3                 :1;
        unsigned G1PHR4                 :1;
        unsigned G1PHR5                 :1;
    };
} COG1PHRbits_t;
