MikroElektronika/core_packages/PIC/XC8/def/PIC16F1773/mcu.h
// Register: COG1BLKR
#define COG1BLKR COG1BLKR
extern volatile unsigned char           COG1BLKR            __at(0x68F);
#ifndef _LIB_BUILD
asm("COG1BLKR equ 068Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BLKR                   :6;
    };
    struct {
        unsigned BLKR0                  :1;
        unsigned BLKR1                  :1;
        unsigned BLKR2                  :1;
        unsigned BLKR3                  :1;
        unsigned BLKR4                  :1;
        unsigned BLKR5                  :1;
    };
    struct {
        unsigned G1BLKR0                :1;
        unsigned G1BLKR1                :1;
        unsigned G1BLKR2                :1;
        unsigned G1BLKR3                :1;
        unsigned G1BLKR4                :1;
        unsigned G1BLKR5                :1;
    };
} COG1BLKRbits_t;
extern volatile COG1BLKRbits_t COG1BLKRbits __at(0x68F);
// bitfield macros
#define _COG1BLKR_BLKR_POSN                                 0x0
#define _COG1BLKR_BLKR_POSITION                             0x0
#define _COG1BLKR_BLKR_SIZE                                 0x6
#define _COG1BLKR_BLKR_LENGTH                               0x6
#define _COG1BLKR_BLKR_MASK                                 0x3F
#define _COG1BLKR_BLKR0_POSN                                0x0
#define _COG1BLKR_BLKR0_POSITION                            0x0
#define _COG1BLKR_BLKR0_SIZE                                0x1
#define _COG1BLKR_BLKR0_LENGTH                              0x1
#define _COG1BLKR_BLKR0_MASK                                0x1
#define _COG1BLKR_BLKR1_POSN                                0x1
#define _COG1BLKR_BLKR1_POSITION                            0x1
#define _COG1BLKR_BLKR1_SIZE                                0x1
#define _COG1BLKR_BLKR1_LENGTH                              0x1
#define _COG1BLKR_BLKR1_MASK                                0x2
#define _COG1BLKR_BLKR2_POSN                                0x2
#define _COG1BLKR_BLKR2_POSITION                            0x2
#define _COG1BLKR_BLKR2_SIZE                                0x1
#define _COG1BLKR_BLKR2_LENGTH                              0x1
#define _COG1BLKR_BLKR2_MASK                                0x4
#define _COG1BLKR_BLKR3_POSN                                0x3
#define _COG1BLKR_BLKR3_POSITION                            0x3
#define _COG1BLKR_BLKR3_SIZE                                0x1
#define _COG1BLKR_BLKR3_LENGTH                              0x1
#define _COG1BLKR_BLKR3_MASK                                0x8
#define _COG1BLKR_BLKR4_POSN                                0x4
#define _COG1BLKR_BLKR4_POSITION                            0x4
#define _COG1BLKR_BLKR4_SIZE                                0x1
#define _COG1BLKR_BLKR4_LENGTH                              0x1
#define _COG1BLKR_BLKR4_MASK                                0x10
#define _COG1BLKR_BLKR5_POSN                                0x5
#define _COG1BLKR_BLKR5_POSITION                            0x5
#define _COG1BLKR_BLKR5_SIZE                                0x1
#define _COG1BLKR_BLKR5_LENGTH                              0x1
#define _COG1BLKR_BLKR5_MASK                                0x20
#define _COG1BLKR_G1BLKR0_POSN                              0x0
#define _COG1BLKR_G1BLKR0_POSITION                          0x0
#define _COG1BLKR_G1BLKR0_SIZE                              0x1
#define _COG1BLKR_G1BLKR0_LENGTH                            0x1
#define _COG1BLKR_G1BLKR0_MASK                              0x1
#define _COG1BLKR_G1BLKR1_POSN                              0x1
#define _COG1BLKR_G1BLKR1_POSITION                          0x1
#define _COG1BLKR_G1BLKR1_SIZE                              0x1
#define _COG1BLKR_G1BLKR1_LENGTH                            0x1
#define _COG1BLKR_G1BLKR1_MASK                              0x2
#define _COG1BLKR_G1BLKR2_POSN                              0x2
#define _COG1BLKR_G1BLKR2_POSITION                          0x2
#define _COG1BLKR_G1BLKR2_SIZE                              0x1
#define _COG1BLKR_G1BLKR2_LENGTH                            0x1
#define _COG1BLKR_G1BLKR2_MASK                              0x4
#define _COG1BLKR_G1BLKR3_POSN                              0x3
#define _COG1BLKR_G1BLKR3_POSITION                          0x3
#define _COG1BLKR_G1BLKR3_SIZE                              0x1
#define _COG1BLKR_G1BLKR3_LENGTH                            0x1
#define _COG1BLKR_G1BLKR3_MASK                              0x8
#define _COG1BLKR_G1BLKR4_POSN                              0x4
#define _COG1BLKR_G1BLKR4_POSITION                          0x4
#define _COG1BLKR_G1BLKR4_SIZE                              0x1
#define _COG1BLKR_G1BLKR4_LENGTH                            0x1
#define _COG1BLKR_G1BLKR4_MASK                              0x10
#define _COG1BLKR_G1BLKR5_POSN                              0x5
#define _COG1BLKR_G1BLKR5_POSITION                          0x5
#define _COG1BLKR_G1BLKR5_SIZE                              0x1
#define _COG1BLKR_G1BLKR5_LENGTH                            0x1
#define _COG1BLKR_G1BLKR5_MASK                              0x20

// Register: COG1BLKF
#define COG1BLKF COG1BLKF
extern volatile unsigned char           COG1BLKF            __at(0x690);
#ifndef _LIB_BUILD
asm("COG1BLKF equ 0690h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BLKF                   :6;
    };
    struct {
        unsigned BLKF0                  :1;
        unsigned BLKF1                  :1;
        unsigned BLKF2                  :1;
        unsigned BLKF3                  :1;
        unsigned BLKF4                  :1;
        unsigned BLKF5                  :1;
    };
    struct {
        unsigned G1BLKF0                :1;
        unsigned G1BLKF1                :1;
        unsigned G1BLKF2                :1;
        unsigned G1BLKF3                :1;
        unsigned G1BLKF4                :1;
        unsigned G1BLKF5                :1;
    };
} COG1BLKFbits_t;
extern volatile COG1BLKFbits_t COG1BLKFbits __at(0x690);
// bitfield macros
#define _COG1BLKF_BLKF_POSN                                 0x0
#define _COG1BLKF_BLKF_POSITION                             0x0
#define _COG1BLKF_BLKF_SIZE                                 0x6
#define _COG1BLKF_BLKF_LENGTH                               0x6
#define _COG1BLKF_BLKF_MASK                                 0x3F
#define _COG1BLKF_BLKF0_POSN                                0x0
#define _COG1BLKF_BLKF0_POSITION                            0x0
#define _COG1BLKF_BLKF0_SIZE                                0x1
#define _COG1BLKF_BLKF0_LENGTH                              0x1
#define _COG1BLKF_BLKF0_MASK                                0x1
#define _COG1BLKF_BLKF1_POSN                                0x1
#define _COG1BLKF_BLKF1_POSITION                            0x1
#define _COG1BLKF_BLKF1_SIZE                                0x1
#define _COG1BLKF_BLKF1_LENGTH                              0x1
#define _COG1BLKF_BLKF1_MASK                                0x2
#define _COG1BLKF_BLKF2_POSN                                0x2
#define _COG1BLKF_BLKF2_POSITION                            0x2
#define _COG1BLKF_BLKF2_SIZE                                0x1
#define _COG1BLKF_BLKF2_LENGTH                              0x1
#define _COG1BLKF_BLKF2_MASK                                0x4
#define _COG1BLKF_BLKF3_POSN                                0x3
#define _COG1BLKF_BLKF3_POSITION                            0x3
#define _COG1BLKF_BLKF3_SIZE                                0x1
#define _COG1BLKF_BLKF3_LENGTH                              0x1
#define _COG1BLKF_BLKF3_MASK                                0x8
#define _COG1BLKF_BLKF4_POSN                                0x4
#define _COG1BLKF_BLKF4_POSITION                            0x4
#define _COG1BLKF_BLKF4_SIZE                                0x1
#define _COG1BLKF_BLKF4_LENGTH                              0x1
#define _COG1BLKF_BLKF4_MASK                                0x10
#define _COG1BLKF_BLKF5_POSN                                0x5
#define _COG1BLKF_BLKF5_POSITION                            0x5
#define _COG1BLKF_BLKF5_SIZE                                0x1
#define _COG1BLKF_BLKF5_LENGTH                              0x1
#define _COG1BLKF_BLKF5_MASK                                0x20
#define _COG1BLKF_G1BLKF0_POSN                              0x0
#define _COG1BLKF_G1BLKF0_POSITION                          0x0
#define _COG1BLKF_G1BLKF0_SIZE                              0x1
#define _COG1BLKF_G1BLKF0_LENGTH                            0x1
#define _COG1BLKF_G1BLKF0_MASK                              0x1
#define _COG1BLKF_G1BLKF1_POSN                              0x1
#define _COG1BLKF_G1BLKF1_POSITION                          0x1
#define _COG1BLKF_G1BLKF1_SIZE                              0x1
#define _COG1BLKF_G1BLKF1_LENGTH                            0x1
#define _COG1BLKF_G1BLKF1_MASK                              0x2
#define _COG1BLKF_G1BLKF2_POSN                              0x2
#define _COG1BLKF_G1BLKF2_POSITION                          0x2
#define _COG1BLKF_G1BLKF2_SIZE                              0x1
#define _COG1BLKF_G1BLKF2_LENGTH                            0x1
#define _COG1BLKF_G1BLKF2_MASK                              0x4
#define _COG1BLKF_G1BLKF3_POSN                              0x3
#define _COG1BLKF_G1BLKF3_POSITION                          0x3
#define _COG1BLKF_G1BLKF3_SIZE                              0x1
#define _COG1BLKF_G1BLKF3_LENGTH                            0x1
#define _COG1BLKF_G1BLKF3_MASK                              0x8
#define _COG1BLKF_G1BLKF4_POSN                              0x4
#define _COG1BLKF_G1BLKF4_POSITION                          0x4
#define _COG1BLKF_G1BLKF4_SIZE                              0x1
#define _COG1BLKF_G1BLKF4_LENGTH                            0x1
#define _COG1BLKF_G1BLKF4_MASK                              0x10
#define _COG1BLKF_G1BLKF5_POSN                              0x5
#define _COG1BLKF_G1BLKF5_POSITION                          0x5
#define _COG1BLKF_G1BLKF5_SIZE                              0x1
#define _COG1BLKF_G1BLKF5_LENGTH                            0x1
#define _COG1BLKF_G1BLKF5_MASK                              0x20

// Register: COG1DBR
#define COG1DBR COG1DBR
extern volatile unsigned char           COG1DBR             __at(0x691);
#ifndef _LIB_BUILD
asm("COG1DBR equ 0691h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DBR                    :6;
    };
    struct {
        unsigned DBR0                   :1;
        unsigned DBR1                   :1;
        unsigned DBR2                   :1;
        unsigned DBR3                   :1;
        unsigned DBR4                   :1;
        unsigned DBR5                   :1;
    };
    struct {
        unsigned G1DBR0                 :1;
        unsigned G1DBR1                 :1;
        unsigned G1DBR2                 :1;
        unsigned G1DBR3                 :1;
        unsigned G1DBR4                 :1;
        unsigned G1DBR5                 :1;
    };
} COG1DBRbits_t;
extern volatile COG1DBRbits_t COG1DBRbits __at(0x691);
// bitfield macros
#define _COG1DBR_DBR_POSN                                   0x0
#define _COG1DBR_DBR_POSITION                               0x0
#define _COG1DBR_DBR_SIZE                                   0x6
#define _COG1DBR_DBR_LENGTH                                 0x6
#define _COG1DBR_DBR_MASK                                   0x3F
#define _COG1DBR_DBR0_POSN                                  0x0
#define _COG1DBR_DBR0_POSITION                              0x0
#define _COG1DBR_DBR0_SIZE                                  0x1
#define _COG1DBR_DBR0_LENGTH                                0x1
#define _COG1DBR_DBR0_MASK                                  0x1
#define _COG1DBR_DBR1_POSN                                  0x1
#define _COG1DBR_DBR1_POSITION                              0x1
#define _COG1DBR_DBR1_SIZE                                  0x1
#define _COG1DBR_DBR1_LENGTH                                0x1
#define _COG1DBR_DBR1_MASK                                  0x2
#define _COG1DBR_DBR2_POSN                                  0x2
#define _COG1DBR_DBR2_POSITION                              0x2
#define _COG1DBR_DBR2_SIZE                                  0x1
#define _COG1DBR_DBR2_LENGTH                                0x1
#define _COG1DBR_DBR2_MASK                                  0x4
#define _COG1DBR_DBR3_POSN                                  0x3
#define _COG1DBR_DBR3_POSITION                              0x3
#define _COG1DBR_DBR3_SIZE                                  0x1
#define _COG1DBR_DBR3_LENGTH                                0x1
#define _COG1DBR_DBR3_MASK                                  0x8
#define _COG1DBR_DBR4_POSN                                  0x4
#define _COG1DBR_DBR4_POSITION                              0x4
#define _COG1DBR_DBR4_SIZE                                  0x1
#define _COG1DBR_DBR4_LENGTH                                0x1
#define _COG1DBR_DBR4_MASK                                  0x10
#define _COG1DBR_DBR5_POSN                                  0x5
#define _COG1DBR_DBR5_POSITION                              0x5
#define _COG1DBR_DBR5_SIZE                                  0x1
#define _COG1DBR_DBR5_LENGTH                                0x1
#define _COG1DBR_DBR5_MASK                                  0x20
#define _COG1DBR_G1DBR0_POSN                                0x0
#define _COG1DBR_G1DBR0_POSITION                            0x0
#define _COG1DBR_G1DBR0_SIZE                                0x1
#define _COG1DBR_G1DBR0_LENGTH                              0x1
#define _COG1DBR_G1DBR0_MASK                                0x1
#define _COG1DBR_G1DBR1_POSN                                0x1
#define _COG1DBR_G1DBR1_POSITION                            0x1
#define _COG1DBR_G1DBR1_SIZE                                0x1
#define _COG1DBR_G1DBR1_LENGTH                              0x1
#define _COG1DBR_G1DBR1_MASK                                0x2
#define _COG1DBR_G1DBR2_POSN                                0x2
#define _COG1DBR_G1DBR2_POSITION                            0x2
#define _COG1DBR_G1DBR2_SIZE                                0x1
#define _COG1DBR_G1DBR2_LENGTH                              0x1
#define _COG1DBR_G1DBR2_MASK                                0x4
#define _COG1DBR_G1DBR3_POSN                                0x3
#define _COG1DBR_G1DBR3_POSITION                            0x3
#define _COG1DBR_G1DBR3_SIZE                                0x1
#define _COG1DBR_G1DBR3_LENGTH                              0x1
#define _COG1DBR_G1DBR3_MASK                                0x8
#define _COG1DBR_G1DBR4_POSN                                0x4
#define _COG1DBR_G1DBR4_POSITION                            0x4
#define _COG1DBR_G1DBR4_SIZE                                0x1
#define _COG1DBR_G1DBR4_LENGTH                              0x1
#define _COG1DBR_G1DBR4_MASK                                0x10
#define _COG1DBR_G1DBR5_POSN                                0x5
#define _COG1DBR_G1DBR5_POSITION                            0x5
#define _COG1DBR_G1DBR5_SIZE                                0x1
#define _COG1DBR_G1DBR5_LENGTH                              0x1
#define _COG1DBR_G1DBR5_MASK                                0x20

