MikroElektronika/core_packages/PIC/XC8/def/PIC16F1773/mcu.h
// Register: COG3PHR
#define COG3PHR COG3PHR
extern volatile unsigned char           COG3PHR             __at(0x80D);
#ifndef _LIB_BUILD
asm("COG3PHR equ 080Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PHR                    :6;
    };
    struct {
        unsigned PHR0                   :1;
        unsigned PHR1                   :1;
        unsigned PHR2                   :1;
        unsigned PHR3                   :1;
        unsigned PHR4                   :1;
        unsigned PHR5                   :1;
    };
    struct {
        unsigned G3PHR0                 :1;
        unsigned G3PHR1                 :1;
        unsigned G3PHR2                 :1;
        unsigned G3PHR3                 :1;
        unsigned G3PHR4                 :1;
        unsigned G3PHR5                 :1;
    };
} COG3PHRbits_t;
extern volatile COG3PHRbits_t COG3PHRbits __at(0x80D);
// bitfield macros
#define _COG3PHR_PHR_POSN                                   0x0
#define _COG3PHR_PHR_POSITION                               0x0
#define _COG3PHR_PHR_SIZE                                   0x6
#define _COG3PHR_PHR_LENGTH                                 0x6
#define _COG3PHR_PHR_MASK                                   0x3F
#define _COG3PHR_PHR0_POSN                                  0x0
#define _COG3PHR_PHR0_POSITION                              0x0
#define _COG3PHR_PHR0_SIZE                                  0x1
#define _COG3PHR_PHR0_LENGTH                                0x1
#define _COG3PHR_PHR0_MASK                                  0x1
#define _COG3PHR_PHR1_POSN                                  0x1
#define _COG3PHR_PHR1_POSITION                              0x1
#define _COG3PHR_PHR1_SIZE                                  0x1
#define _COG3PHR_PHR1_LENGTH                                0x1
#define _COG3PHR_PHR1_MASK                                  0x2
#define _COG3PHR_PHR2_POSN                                  0x2
#define _COG3PHR_PHR2_POSITION                              0x2
#define _COG3PHR_PHR2_SIZE                                  0x1
#define _COG3PHR_PHR2_LENGTH                                0x1
#define _COG3PHR_PHR2_MASK                                  0x4
#define _COG3PHR_PHR3_POSN                                  0x3
#define _COG3PHR_PHR3_POSITION                              0x3
#define _COG3PHR_PHR3_SIZE                                  0x1
#define _COG3PHR_PHR3_LENGTH                                0x1
#define _COG3PHR_PHR3_MASK                                  0x8
#define _COG3PHR_PHR4_POSN                                  0x4
#define _COG3PHR_PHR4_POSITION                              0x4
#define _COG3PHR_PHR4_SIZE                                  0x1
#define _COG3PHR_PHR4_LENGTH                                0x1
#define _COG3PHR_PHR4_MASK                                  0x10
#define _COG3PHR_PHR5_POSN                                  0x5
#define _COG3PHR_PHR5_POSITION                              0x5
#define _COG3PHR_PHR5_SIZE                                  0x1
#define _COG3PHR_PHR5_LENGTH                                0x1
#define _COG3PHR_PHR5_MASK                                  0x20
#define _COG3PHR_G3PHR0_POSN                                0x0
#define _COG3PHR_G3PHR0_POSITION                            0x0
#define _COG3PHR_G3PHR0_SIZE                                0x1
#define _COG3PHR_G3PHR0_LENGTH                              0x1
#define _COG3PHR_G3PHR0_MASK                                0x1
#define _COG3PHR_G3PHR1_POSN                                0x1
#define _COG3PHR_G3PHR1_POSITION                            0x1
#define _COG3PHR_G3PHR1_SIZE                                0x1
#define _COG3PHR_G3PHR1_LENGTH                              0x1
#define _COG3PHR_G3PHR1_MASK                                0x2
#define _COG3PHR_G3PHR2_POSN                                0x2
#define _COG3PHR_G3PHR2_POSITION                            0x2
#define _COG3PHR_G3PHR2_SIZE                                0x1
#define _COG3PHR_G3PHR2_LENGTH                              0x1
#define _COG3PHR_G3PHR2_MASK                                0x4
#define _COG3PHR_G3PHR3_POSN                                0x3
#define _COG3PHR_G3PHR3_POSITION                            0x3
#define _COG3PHR_G3PHR3_SIZE                                0x1
#define _COG3PHR_G3PHR3_LENGTH                              0x1
#define _COG3PHR_G3PHR3_MASK                                0x8
#define _COG3PHR_G3PHR4_POSN                                0x4
#define _COG3PHR_G3PHR4_POSITION                            0x4
#define _COG3PHR_G3PHR4_SIZE                                0x1
#define _COG3PHR_G3PHR4_LENGTH                              0x1
#define _COG3PHR_G3PHR4_MASK                                0x10
#define _COG3PHR_G3PHR5_POSN                                0x5
#define _COG3PHR_G3PHR5_POSITION                            0x5
#define _COG3PHR_G3PHR5_SIZE                                0x1
#define _COG3PHR_G3PHR5_LENGTH                              0x1
#define _COG3PHR_G3PHR5_MASK                                0x20

// Register: COG3PHF
#define COG3PHF COG3PHF
extern volatile unsigned char           COG3PHF             __at(0x80E);
#ifndef _LIB_BUILD
asm("COG3PHF equ 080Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PHF                    :6;
    };
    struct {
        unsigned PHF0                   :1;
        unsigned PHF1                   :1;
        unsigned PHF2                   :1;
        unsigned PHF3                   :1;
        unsigned PHF4                   :1;
        unsigned PHF5                   :1;
    };
    struct {
        unsigned G3PHF0                 :1;
        unsigned G3PHF1                 :1;
        unsigned G3PHF2                 :1;
        unsigned G3PHF3                 :1;
        unsigned G3PHF4                 :1;
        unsigned G3PHF5                 :1;
    };
} COG3PHFbits_t;
extern volatile COG3PHFbits_t COG3PHFbits __at(0x80E);
// bitfield macros
#define _COG3PHF_PHF_POSN                                   0x0
#define _COG3PHF_PHF_POSITION                               0x0
#define _COG3PHF_PHF_SIZE                                   0x6
#define _COG3PHF_PHF_LENGTH                                 0x6
#define _COG3PHF_PHF_MASK                                   0x3F
#define _COG3PHF_PHF0_POSN                                  0x0
#define _COG3PHF_PHF0_POSITION                              0x0
#define _COG3PHF_PHF0_SIZE                                  0x1
#define _COG3PHF_PHF0_LENGTH                                0x1
#define _COG3PHF_PHF0_MASK                                  0x1
#define _COG3PHF_PHF1_POSN                                  0x1
#define _COG3PHF_PHF1_POSITION                              0x1
#define _COG3PHF_PHF1_SIZE                                  0x1
#define _COG3PHF_PHF1_LENGTH                                0x1
#define _COG3PHF_PHF1_MASK                                  0x2
#define _COG3PHF_PHF2_POSN                                  0x2
#define _COG3PHF_PHF2_POSITION                              0x2
#define _COG3PHF_PHF2_SIZE                                  0x1
#define _COG3PHF_PHF2_LENGTH                                0x1
#define _COG3PHF_PHF2_MASK                                  0x4
#define _COG3PHF_PHF3_POSN                                  0x3
#define _COG3PHF_PHF3_POSITION                              0x3
#define _COG3PHF_PHF3_SIZE                                  0x1
#define _COG3PHF_PHF3_LENGTH                                0x1
#define _COG3PHF_PHF3_MASK                                  0x8
#define _COG3PHF_PHF4_POSN                                  0x4
#define _COG3PHF_PHF4_POSITION                              0x4
#define _COG3PHF_PHF4_SIZE                                  0x1
#define _COG3PHF_PHF4_LENGTH                                0x1
#define _COG3PHF_PHF4_MASK                                  0x10
#define _COG3PHF_PHF5_POSN                                  0x5
#define _COG3PHF_PHF5_POSITION                              0x5
#define _COG3PHF_PHF5_SIZE                                  0x1
#define _COG3PHF_PHF5_LENGTH                                0x1
#define _COG3PHF_PHF5_MASK                                  0x20
#define _COG3PHF_G3PHF0_POSN                                0x0
#define _COG3PHF_G3PHF0_POSITION                            0x0
#define _COG3PHF_G3PHF0_SIZE                                0x1
#define _COG3PHF_G3PHF0_LENGTH                              0x1
#define _COG3PHF_G3PHF0_MASK                                0x1
#define _COG3PHF_G3PHF1_POSN                                0x1
#define _COG3PHF_G3PHF1_POSITION                            0x1
#define _COG3PHF_G3PHF1_SIZE                                0x1
#define _COG3PHF_G3PHF1_LENGTH                              0x1
#define _COG3PHF_G3PHF1_MASK                                0x2
#define _COG3PHF_G3PHF2_POSN                                0x2
#define _COG3PHF_G3PHF2_POSITION                            0x2
#define _COG3PHF_G3PHF2_SIZE                                0x1
#define _COG3PHF_G3PHF2_LENGTH                              0x1
#define _COG3PHF_G3PHF2_MASK                                0x4
#define _COG3PHF_G3PHF3_POSN                                0x3
#define _COG3PHF_G3PHF3_POSITION                            0x3
#define _COG3PHF_G3PHF3_SIZE                                0x1
#define _COG3PHF_G3PHF3_LENGTH                              0x1
#define _COG3PHF_G3PHF3_MASK                                0x8
#define _COG3PHF_G3PHF4_POSN                                0x4
#define _COG3PHF_G3PHF4_POSITION                            0x4
#define _COG3PHF_G3PHF4_SIZE                                0x1
#define _COG3PHF_G3PHF4_LENGTH                              0x1
#define _COG3PHF_G3PHF4_MASK                                0x10
#define _COG3PHF_G3PHF5_POSN                                0x5
#define _COG3PHF_G3PHF5_POSITION                            0x5
#define _COG3PHF_G3PHF5_SIZE                                0x1
#define _COG3PHF_G3PHF5_LENGTH                              0x1
#define _COG3PHF_G3PHF5_MASK                                0x20

