MikroElektronika/core_packages/PIC/XC8/def/PIC16F1773/mcu.h
extern volatile COG3CON0bits_t COG3CON0bits __at(0x813);
// bitfield macros
#define _COG3CON0_MD_POSN                                   0x0
#define _COG3CON0_MD_POSITION                               0x0
#define _COG3CON0_MD_SIZE                                   0x3
#define _COG3CON0_MD_LENGTH                                 0x3
#define _COG3CON0_MD_MASK                                   0x7
#define _COG3CON0_CS_POSN                                   0x3
#define _COG3CON0_CS_POSITION                               0x3
#define _COG3CON0_CS_SIZE                                   0x2
#define _COG3CON0_CS_LENGTH                                 0x2
#define _COG3CON0_CS_MASK                                   0x18
#define _COG3CON0_LD_POSN                                   0x6
#define _COG3CON0_LD_POSITION                               0x6
#define _COG3CON0_LD_SIZE                                   0x1
#define _COG3CON0_LD_LENGTH                                 0x1
#define _COG3CON0_LD_MASK                                   0x40
#define _COG3CON0_EN_POSN                                   0x7
#define _COG3CON0_EN_POSITION                               0x7
#define _COG3CON0_EN_SIZE                                   0x1
#define _COG3CON0_EN_LENGTH                                 0x1
#define _COG3CON0_EN_MASK                                   0x80
#define _COG3CON0_MD0_POSN                                  0x0
#define _COG3CON0_MD0_POSITION                              0x0
#define _COG3CON0_MD0_SIZE                                  0x1
#define _COG3CON0_MD0_LENGTH                                0x1
#define _COG3CON0_MD0_MASK                                  0x1
#define _COG3CON0_MD1_POSN                                  0x1
#define _COG3CON0_MD1_POSITION                              0x1
#define _COG3CON0_MD1_SIZE                                  0x1
#define _COG3CON0_MD1_LENGTH                                0x1
#define _COG3CON0_MD1_MASK                                  0x2
#define _COG3CON0_MD2_POSN                                  0x2
#define _COG3CON0_MD2_POSITION                              0x2
#define _COG3CON0_MD2_SIZE                                  0x1
#define _COG3CON0_MD2_LENGTH                                0x1
#define _COG3CON0_MD2_MASK                                  0x4
#define _COG3CON0_CS0_POSN                                  0x3
#define _COG3CON0_CS0_POSITION                              0x3
#define _COG3CON0_CS0_SIZE                                  0x1
#define _COG3CON0_CS0_LENGTH                                0x1
#define _COG3CON0_CS0_MASK                                  0x8
#define _COG3CON0_CS1_POSN                                  0x4
#define _COG3CON0_CS1_POSITION                              0x4
#define _COG3CON0_CS1_SIZE                                  0x1
#define _COG3CON0_CS1_LENGTH                                0x1
#define _COG3CON0_CS1_MASK                                  0x10
#define _COG3CON0_G3MD_POSN                                 0x0
#define _COG3CON0_G3MD_POSITION                             0x0
#define _COG3CON0_G3MD_SIZE                                 0x3
#define _COG3CON0_G3MD_LENGTH                               0x3
#define _COG3CON0_G3MD_MASK                                 0x7
#define _COG3CON0_G3CS_POSN                                 0x3
#define _COG3CON0_G3CS_POSITION                             0x3
#define _COG3CON0_G3CS_SIZE                                 0x2
#define _COG3CON0_G3CS_LENGTH                               0x2
#define _COG3CON0_G3CS_MASK                                 0x18
#define _COG3CON0_G3LD_POSN                                 0x6
#define _COG3CON0_G3LD_POSITION                             0x6
#define _COG3CON0_G3LD_SIZE                                 0x1
#define _COG3CON0_G3LD_LENGTH                               0x1
#define _COG3CON0_G3LD_MASK                                 0x40
#define _COG3CON0_G3EN_POSN                                 0x7
#define _COG3CON0_G3EN_POSITION                             0x7
#define _COG3CON0_G3EN_SIZE                                 0x1
#define _COG3CON0_G3EN_LENGTH                               0x1
#define _COG3CON0_G3EN_MASK                                 0x80
#define _COG3CON0_G3MD0_POSN                                0x0
#define _COG3CON0_G3MD0_POSITION                            0x0
#define _COG3CON0_G3MD0_SIZE                                0x1
#define _COG3CON0_G3MD0_LENGTH                              0x1
#define _COG3CON0_G3MD0_MASK                                0x1
#define _COG3CON0_G3MD1_POSN                                0x1
#define _COG3CON0_G3MD1_POSITION                            0x1
#define _COG3CON0_G3MD1_SIZE                                0x1
#define _COG3CON0_G3MD1_LENGTH                              0x1
#define _COG3CON0_G3MD1_MASK                                0x2
#define _COG3CON0_G3MD2_POSN                                0x2
#define _COG3CON0_G3MD2_POSITION                            0x2
#define _COG3CON0_G3MD2_SIZE                                0x1
#define _COG3CON0_G3MD2_LENGTH                              0x1
#define _COG3CON0_G3MD2_MASK                                0x4
#define _COG3CON0_G3CS0_POSN                                0x3
#define _COG3CON0_G3CS0_POSITION                            0x3
#define _COG3CON0_G3CS0_SIZE                                0x1
#define _COG3CON0_G3CS0_LENGTH                              0x1
#define _COG3CON0_G3CS0_MASK                                0x8
#define _COG3CON0_G3CS1_POSN                                0x4
#define _COG3CON0_G3CS1_POSITION                            0x4
#define _COG3CON0_G3CS1_SIZE                                0x1
#define _COG3CON0_G3CS1_LENGTH                              0x1
#define _COG3CON0_G3CS1_MASK                                0x10

// Register: COG3CON1
#define COG3CON1 COG3CON1
extern volatile unsigned char           COG3CON1            __at(0x814);
#ifndef _LIB_BUILD
asm("COG3CON1 equ 0814h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned POLA                   :1;
        unsigned POLB                   :1;
        unsigned POLC                   :1;
        unsigned POLD                   :1;
        unsigned                        :2;
        unsigned FDBS                   :1;
        unsigned RDBS                   :1;
    };
    struct {
        unsigned G3POLA                 :1;
        unsigned G3POLB                 :1;
        unsigned G3POLC                 :1;
        unsigned G3POLD                 :1;
        unsigned                        :2;
        unsigned G3FDBS                 :1;
        unsigned G3RDBS                 :1;
    };
} COG3CON1bits_t;
extern volatile COG3CON1bits_t COG3CON1bits __at(0x814);
// bitfield macros
#define _COG3CON1_POLA_POSN                                 0x0
#define _COG3CON1_POLA_POSITION                             0x0
#define _COG3CON1_POLA_SIZE                                 0x1
#define _COG3CON1_POLA_LENGTH                               0x1
#define _COG3CON1_POLA_MASK                                 0x1
#define _COG3CON1_POLB_POSN                                 0x1
#define _COG3CON1_POLB_POSITION                             0x1
#define _COG3CON1_POLB_SIZE                                 0x1
#define _COG3CON1_POLB_LENGTH                               0x1
#define _COG3CON1_POLB_MASK                                 0x2
#define _COG3CON1_POLC_POSN                                 0x2
#define _COG3CON1_POLC_POSITION                             0x2
#define _COG3CON1_POLC_SIZE                                 0x1
#define _COG3CON1_POLC_LENGTH                               0x1
#define _COG3CON1_POLC_MASK                                 0x4
#define _COG3CON1_POLD_POSN                                 0x3
#define _COG3CON1_POLD_POSITION                             0x3
#define _COG3CON1_POLD_SIZE                                 0x1
#define _COG3CON1_POLD_LENGTH                               0x1
#define _COG3CON1_POLD_MASK                                 0x8
#define _COG3CON1_FDBS_POSN                                 0x6
#define _COG3CON1_FDBS_POSITION                             0x6
#define _COG3CON1_FDBS_SIZE                                 0x1
#define _COG3CON1_FDBS_LENGTH                               0x1
#define _COG3CON1_FDBS_MASK                                 0x40
#define _COG3CON1_RDBS_POSN                                 0x7
#define _COG3CON1_RDBS_POSITION                             0x7
#define _COG3CON1_RDBS_SIZE                                 0x1
#define _COG3CON1_RDBS_LENGTH                               0x1
#define _COG3CON1_RDBS_MASK                                 0x80
#define _COG3CON1_G3POLA_POSN                               0x0
#define _COG3CON1_G3POLA_POSITION                           0x0
#define _COG3CON1_G3POLA_SIZE                               0x1
#define _COG3CON1_G3POLA_LENGTH                             0x1
#define _COG3CON1_G3POLA_MASK                               0x1
#define _COG3CON1_G3POLB_POSN                               0x1
#define _COG3CON1_G3POLB_POSITION                           0x1
#define _COG3CON1_G3POLB_SIZE                               0x1
#define _COG3CON1_G3POLB_LENGTH                             0x1
#define _COG3CON1_G3POLB_MASK                               0x2
#define _COG3CON1_G3POLC_POSN                               0x2
#define _COG3CON1_G3POLC_POSITION                           0x2
#define _COG3CON1_G3POLC_SIZE                               0x1
#define _COG3CON1_G3POLC_LENGTH                             0x1
#define _COG3CON1_G3POLC_MASK                               0x4
#define _COG3CON1_G3POLD_POSN                               0x3
#define _COG3CON1_G3POLD_POSITION                           0x3
#define _COG3CON1_G3POLD_SIZE                               0x1
#define _COG3CON1_G3POLD_LENGTH                             0x1
#define _COG3CON1_G3POLD_MASK                               0x8
#define _COG3CON1_G3FDBS_POSN                               0x6
#define _COG3CON1_G3FDBS_POSITION                           0x6
#define _COG3CON1_G3FDBS_SIZE                               0x1
#define _COG3CON1_G3FDBS_LENGTH                             0x1
#define _COG3CON1_G3FDBS_MASK                               0x40
#define _COG3CON1_G3RDBS_POSN                               0x7
#define _COG3CON1_G3RDBS_POSITION                           0x7
#define _COG3CON1_G3RDBS_SIZE                               0x1
#define _COG3CON1_G3RDBS_LENGTH                             0x1
#define _COG3CON1_G3RDBS_MASK                               0x80

// Register: COG3RIS0
#define COG3RIS0 COG3RIS0
extern volatile unsigned char           COG3RIS0            __at(0x815);
#ifndef _LIB_BUILD
asm("COG3RIS0 equ 0815h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RIS0                   :1;
        unsigned RIS1                   :1;
        unsigned RIS2                   :1;
        unsigned RIS3                   :1;
        unsigned RIS4                   :1;
        unsigned RIS5                   :1;
        unsigned RIS6                   :1;
        unsigned RIS7                   :1;
    };
    struct {
        unsigned G3RIS0                 :1;
        unsigned G3RIS1                 :1;
        unsigned G3RIS2                 :1;
        unsigned G3RIS3                 :1;
        unsigned G3RIS4                 :1;
        unsigned G3RIS5                 :1;
        unsigned G3RIS6                 :1;
        unsigned G3RIS7                 :1;
    };
} COG3RIS0bits_t;
extern volatile COG3RIS0bits_t COG3RIS0bits __at(0x815);
// bitfield macros
#define _COG3RIS0_RIS0_POSN                                 0x0
#define _COG3RIS0_RIS0_POSITION                             0x0
#define _COG3RIS0_RIS0_SIZE                                 0x1
#define _COG3RIS0_RIS0_LENGTH                               0x1
#define _COG3RIS0_RIS0_MASK                                 0x1
#define _COG3RIS0_RIS1_POSN                                 0x1
#define _COG3RIS0_RIS1_POSITION                             0x1
#define _COG3RIS0_RIS1_SIZE                                 0x1
#define _COG3RIS0_RIS1_LENGTH                               0x1
#define _COG3RIS0_RIS1_MASK                                 0x2
#define _COG3RIS0_RIS2_POSN                                 0x2
#define _COG3RIS0_RIS2_POSITION                             0x2
#define _COG3RIS0_RIS2_SIZE                                 0x1
#define _COG3RIS0_RIS2_LENGTH                               0x1
#define _COG3RIS0_RIS2_MASK                                 0x4
#define _COG3RIS0_RIS3_POSN                                 0x3
#define _COG3RIS0_RIS3_POSITION                             0x3
#define _COG3RIS0_RIS3_SIZE                                 0x1
#define _COG3RIS0_RIS3_LENGTH                               0x1
#define _COG3RIS0_RIS3_MASK                                 0x8
#define _COG3RIS0_RIS4_POSN                                 0x4
#define _COG3RIS0_RIS4_POSITION                             0x4
#define _COG3RIS0_RIS4_SIZE                                 0x1
#define _COG3RIS0_RIS4_LENGTH                               0x1
#define _COG3RIS0_RIS4_MASK                                 0x10
#define _COG3RIS0_RIS5_POSN                                 0x5
#define _COG3RIS0_RIS5_POSITION                             0x5
#define _COG3RIS0_RIS5_SIZE                                 0x1
#define _COG3RIS0_RIS5_LENGTH                               0x1
#define _COG3RIS0_RIS5_MASK                                 0x20
#define _COG3RIS0_RIS6_POSN                                 0x6
#define _COG3RIS0_RIS6_POSITION                             0x6
#define _COG3RIS0_RIS6_SIZE                                 0x1
#define _COG3RIS0_RIS6_LENGTH                               0x1
#define _COG3RIS0_RIS6_MASK                                 0x40
#define _COG3RIS0_RIS7_POSN                                 0x7
#define _COG3RIS0_RIS7_POSITION                             0x7
#define _COG3RIS0_RIS7_SIZE                                 0x1
#define _COG3RIS0_RIS7_LENGTH                               0x1
#define _COG3RIS0_RIS7_MASK                                 0x80
#define _COG3RIS0_G3RIS0_POSN                               0x0
#define _COG3RIS0_G3RIS0_POSITION                           0x0
#define _COG3RIS0_G3RIS0_SIZE                               0x1
#define _COG3RIS0_G3RIS0_LENGTH                             0x1
#define _COG3RIS0_G3RIS0_MASK                               0x1
#define _COG3RIS0_G3RIS1_POSN                               0x1
#define _COG3RIS0_G3RIS1_POSITION                           0x1
#define _COG3RIS0_G3RIS1_SIZE                               0x1
#define _COG3RIS0_G3RIS1_LENGTH                             0x1
#define _COG3RIS0_G3RIS1_MASK                               0x2
#define _COG3RIS0_G3RIS2_POSN                               0x2
#define _COG3RIS0_G3RIS2_POSITION                           0x2
#define _COG3RIS0_G3RIS2_SIZE                               0x1
#define _COG3RIS0_G3RIS2_LENGTH                             0x1
#define _COG3RIS0_G3RIS2_MASK                               0x4
#define _COG3RIS0_G3RIS3_POSN                               0x3
#define _COG3RIS0_G3RIS3_POSITION                           0x3
#define _COG3RIS0_G3RIS3_SIZE                               0x1
#define _COG3RIS0_G3RIS3_LENGTH                             0x1
#define _COG3RIS0_G3RIS3_MASK                               0x8
#define _COG3RIS0_G3RIS4_POSN                               0x4
#define _COG3RIS0_G3RIS4_POSITION                           0x4
#define _COG3RIS0_G3RIS4_SIZE                               0x1
#define _COG3RIS0_G3RIS4_LENGTH                             0x1
#define _COG3RIS0_G3RIS4_MASK                               0x10
#define _COG3RIS0_G3RIS5_POSN                               0x5
#define _COG3RIS0_G3RIS5_POSITION                           0x5
#define _COG3RIS0_G3RIS5_SIZE                               0x1
#define _COG3RIS0_G3RIS5_LENGTH                             0x1
#define _COG3RIS0_G3RIS5_MASK                               0x20
#define _COG3RIS0_G3RIS6_POSN                               0x6
#define _COG3RIS0_G3RIS6_POSITION                           0x6
#define _COG3RIS0_G3RIS6_SIZE                               0x1
#define _COG3RIS0_G3RIS6_LENGTH                             0x1
#define _COG3RIS0_G3RIS6_MASK                               0x40
#define _COG3RIS0_G3RIS7_POSN                               0x7
#define _COG3RIS0_G3RIS7_POSITION                           0x7
#define _COG3RIS0_G3RIS7_SIZE                               0x1
#define _COG3RIS0_G3RIS7_LENGTH                             0x1
#define _COG3RIS0_G3RIS7_MASK                               0x80

// Register: COG3RIS1
#define COG3RIS1 COG3RIS1
extern volatile unsigned char           COG3RIS1            __at(0x816);
#ifndef _LIB_BUILD
asm("COG3RIS1 equ 0816h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned RIS9                   :1;
        unsigned                        :1;
        unsigned RIS11                  :1;
        unsigned RIS12                  :1;
        unsigned RIS13                  :1;
        unsigned RIS14                  :1;
        unsigned RIS15                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned G3RIS9                 :1;
        unsigned                        :1;
        unsigned G3RIS11                :1;
        unsigned G3RIS12                :1;
        unsigned G3RIS13                :1;
        unsigned G3RIS14                :1;
        unsigned G3RIS15                :1;
    };
} COG3RIS1bits_t;
extern volatile COG3RIS1bits_t COG3RIS1bits __at(0x816);
// bitfield macros
#define _COG3RIS1_RIS9_POSN                                 0x1
#define _COG3RIS1_RIS9_POSITION                             0x1
#define _COG3RIS1_RIS9_SIZE                                 0x1
#define _COG3RIS1_RIS9_LENGTH                               0x1
#define _COG3RIS1_RIS9_MASK                                 0x2
#define _COG3RIS1_RIS11_POSN                                0x3
#define _COG3RIS1_RIS11_POSITION                            0x3
#define _COG3RIS1_RIS11_SIZE                                0x1
#define _COG3RIS1_RIS11_LENGTH                              0x1
#define _COG3RIS1_RIS11_MASK                                0x8
#define _COG3RIS1_RIS12_POSN                                0x4
#define _COG3RIS1_RIS12_POSITION                            0x4
#define _COG3RIS1_RIS12_SIZE                                0x1
#define _COG3RIS1_RIS12_LENGTH                              0x1
#define _COG3RIS1_RIS12_MASK                                0x10
#define _COG3RIS1_RIS13_POSN                                0x5
#define _COG3RIS1_RIS13_POSITION                            0x5
#define _COG3RIS1_RIS13_SIZE                                0x1
#define _COG3RIS1_RIS13_LENGTH                              0x1
#define _COG3RIS1_RIS13_MASK                                0x20
#define _COG3RIS1_RIS14_POSN                                0x6
#define _COG3RIS1_RIS14_POSITION                            0x6
#define _COG3RIS1_RIS14_SIZE                                0x1
#define _COG3RIS1_RIS14_LENGTH                              0x1
#define _COG3RIS1_RIS14_MASK                                0x40
#define _COG3RIS1_RIS15_POSN                                0x7
#define _COG3RIS1_RIS15_POSITION                            0x7
#define _COG3RIS1_RIS15_SIZE                                0x1
#define _COG3RIS1_RIS15_LENGTH                              0x1
#define _COG3RIS1_RIS15_MASK                                0x80
#define _COG3RIS1_G3RIS9_POSN                               0x1
#define _COG3RIS1_G3RIS9_POSITION                           0x1
#define _COG3RIS1_G3RIS9_SIZE                               0x1
#define _COG3RIS1_G3RIS9_LENGTH                             0x1
#define _COG3RIS1_G3RIS9_MASK                               0x2
#define _COG3RIS1_G3RIS11_POSN                              0x3
#define _COG3RIS1_G3RIS11_POSITION                          0x3
#define _COG3RIS1_G3RIS11_SIZE                              0x1
#define _COG3RIS1_G3RIS11_LENGTH                            0x1
#define _COG3RIS1_G3RIS11_MASK                              0x8
#define _COG3RIS1_G3RIS12_POSN                              0x4
#define _COG3RIS1_G3RIS12_POSITION                          0x4
#define _COG3RIS1_G3RIS12_SIZE                              0x1
#define _COG3RIS1_G3RIS12_LENGTH                            0x1
#define _COG3RIS1_G3RIS12_MASK                              0x10
#define _COG3RIS1_G3RIS13_POSN                              0x5
#define _COG3RIS1_G3RIS13_POSITION                          0x5
#define _COG3RIS1_G3RIS13_SIZE                              0x1
#define _COG3RIS1_G3RIS13_LENGTH                            0x1
#define _COG3RIS1_G3RIS13_MASK                              0x20
#define _COG3RIS1_G3RIS14_POSN                              0x6
#define _COG3RIS1_G3RIS14_POSITION                          0x6
#define _COG3RIS1_G3RIS14_SIZE                              0x1
#define _COG3RIS1_G3RIS14_LENGTH                            0x1
#define _COG3RIS1_G3RIS14_MASK                              0x40
#define _COG3RIS1_G3RIS15_POSN                              0x7
#define _COG3RIS1_G3RIS15_POSITION                          0x7
#define _COG3RIS1_G3RIS15_SIZE                              0x1
#define _COG3RIS1_G3RIS15_LENGTH                            0x1
#define _COG3RIS1_G3RIS15_MASK                              0x80

