MikroElektronika/core_packages/PIC/XC8/def/PIC16F1773/mcu.h
// Register: COG3RSIM0
#define COG3RSIM0 COG3RSIM0
extern volatile unsigned char           COG3RSIM0           __at(0x817);
#ifndef _LIB_BUILD
asm("COG3RSIM0 equ 0817h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RSIM0                  :1;
        unsigned RSIM1                  :1;
        unsigned RSIM2                  :1;
        unsigned RSIM3                  :1;
        unsigned RSIM4                  :1;
        unsigned RSIM5                  :1;
        unsigned RSIM6                  :1;
        unsigned RSIM7                  :1;
    };
    struct {
        unsigned G3RSIM0                :1;
        unsigned G3RSIM1                :1;
        unsigned G3RSIM2                :1;
        unsigned G3RSIM3                :1;
        unsigned G3RSIM4                :1;
        unsigned G3RSIM5                :1;
        unsigned G3RSIM6                :1;
        unsigned G3RSIM7                :1;
    };
} COG3RSIM0bits_t;
extern volatile COG3RSIM0bits_t COG3RSIM0bits __at(0x817);
// bitfield macros
#define _COG3RSIM0_RSIM0_POSN                               0x0
#define _COG3RSIM0_RSIM0_POSITION                           0x0
#define _COG3RSIM0_RSIM0_SIZE                               0x1
#define _COG3RSIM0_RSIM0_LENGTH                             0x1
#define _COG3RSIM0_RSIM0_MASK                               0x1
#define _COG3RSIM0_RSIM1_POSN                               0x1
#define _COG3RSIM0_RSIM1_POSITION                           0x1
#define _COG3RSIM0_RSIM1_SIZE                               0x1
#define _COG3RSIM0_RSIM1_LENGTH                             0x1
#define _COG3RSIM0_RSIM1_MASK                               0x2
#define _COG3RSIM0_RSIM2_POSN                               0x2
#define _COG3RSIM0_RSIM2_POSITION                           0x2
#define _COG3RSIM0_RSIM2_SIZE                               0x1
#define _COG3RSIM0_RSIM2_LENGTH                             0x1
#define _COG3RSIM0_RSIM2_MASK                               0x4
#define _COG3RSIM0_RSIM3_POSN                               0x3
#define _COG3RSIM0_RSIM3_POSITION                           0x3
#define _COG3RSIM0_RSIM3_SIZE                               0x1
#define _COG3RSIM0_RSIM3_LENGTH                             0x1
#define _COG3RSIM0_RSIM3_MASK                               0x8
#define _COG3RSIM0_RSIM4_POSN                               0x4
#define _COG3RSIM0_RSIM4_POSITION                           0x4
#define _COG3RSIM0_RSIM4_SIZE                               0x1
#define _COG3RSIM0_RSIM4_LENGTH                             0x1
#define _COG3RSIM0_RSIM4_MASK                               0x10
#define _COG3RSIM0_RSIM5_POSN                               0x5
#define _COG3RSIM0_RSIM5_POSITION                           0x5
#define _COG3RSIM0_RSIM5_SIZE                               0x1
#define _COG3RSIM0_RSIM5_LENGTH                             0x1
#define _COG3RSIM0_RSIM5_MASK                               0x20
#define _COG3RSIM0_RSIM6_POSN                               0x6
#define _COG3RSIM0_RSIM6_POSITION                           0x6
#define _COG3RSIM0_RSIM6_SIZE                               0x1
#define _COG3RSIM0_RSIM6_LENGTH                             0x1
#define _COG3RSIM0_RSIM6_MASK                               0x40
#define _COG3RSIM0_RSIM7_POSN                               0x7
#define _COG3RSIM0_RSIM7_POSITION                           0x7
#define _COG3RSIM0_RSIM7_SIZE                               0x1
#define _COG3RSIM0_RSIM7_LENGTH                             0x1
#define _COG3RSIM0_RSIM7_MASK                               0x80
#define _COG3RSIM0_G3RSIM0_POSN                             0x0
#define _COG3RSIM0_G3RSIM0_POSITION                         0x0
#define _COG3RSIM0_G3RSIM0_SIZE                             0x1
#define _COG3RSIM0_G3RSIM0_LENGTH                           0x1
#define _COG3RSIM0_G3RSIM0_MASK                             0x1
#define _COG3RSIM0_G3RSIM1_POSN                             0x1
#define _COG3RSIM0_G3RSIM1_POSITION                         0x1
#define _COG3RSIM0_G3RSIM1_SIZE                             0x1
#define _COG3RSIM0_G3RSIM1_LENGTH                           0x1
#define _COG3RSIM0_G3RSIM1_MASK                             0x2
#define _COG3RSIM0_G3RSIM2_POSN                             0x2
#define _COG3RSIM0_G3RSIM2_POSITION                         0x2
#define _COG3RSIM0_G3RSIM2_SIZE                             0x1
#define _COG3RSIM0_G3RSIM2_LENGTH                           0x1
#define _COG3RSIM0_G3RSIM2_MASK                             0x4
#define _COG3RSIM0_G3RSIM3_POSN                             0x3
#define _COG3RSIM0_G3RSIM3_POSITION                         0x3
#define _COG3RSIM0_G3RSIM3_SIZE                             0x1
#define _COG3RSIM0_G3RSIM3_LENGTH                           0x1
#define _COG3RSIM0_G3RSIM3_MASK                             0x8
#define _COG3RSIM0_G3RSIM4_POSN                             0x4
#define _COG3RSIM0_G3RSIM4_POSITION                         0x4
#define _COG3RSIM0_G3RSIM4_SIZE                             0x1
#define _COG3RSIM0_G3RSIM4_LENGTH                           0x1
#define _COG3RSIM0_G3RSIM4_MASK                             0x10
#define _COG3RSIM0_G3RSIM5_POSN                             0x5
#define _COG3RSIM0_G3RSIM5_POSITION                         0x5
#define _COG3RSIM0_G3RSIM5_SIZE                             0x1
#define _COG3RSIM0_G3RSIM5_LENGTH                           0x1
#define _COG3RSIM0_G3RSIM5_MASK                             0x20
#define _COG3RSIM0_G3RSIM6_POSN                             0x6
#define _COG3RSIM0_G3RSIM6_POSITION                         0x6
#define _COG3RSIM0_G3RSIM6_SIZE                             0x1
#define _COG3RSIM0_G3RSIM6_LENGTH                           0x1
#define _COG3RSIM0_G3RSIM6_MASK                             0x40
#define _COG3RSIM0_G3RSIM7_POSN                             0x7
#define _COG3RSIM0_G3RSIM7_POSITION                         0x7
#define _COG3RSIM0_G3RSIM7_SIZE                             0x1
#define _COG3RSIM0_G3RSIM7_LENGTH                           0x1
#define _COG3RSIM0_G3RSIM7_MASK                             0x80

// Register: COG3RSIM1
#define COG3RSIM1 COG3RSIM1
extern volatile unsigned char           COG3RSIM1           __at(0x818);
#ifndef _LIB_BUILD
asm("COG3RSIM1 equ 0818h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned RSIM9                  :1;
        unsigned                        :1;
        unsigned RSIM11                 :1;
        unsigned RSIM12                 :1;
        unsigned RSIM13                 :1;
        unsigned RSIM14                 :1;
        unsigned RSIM15                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned G3RSIM9                :1;
        unsigned                        :1;
        unsigned G3RSIM11               :1;
        unsigned G3RSIM12               :1;
        unsigned G3RSIM13               :1;
        unsigned G3RSIM14               :1;
        unsigned G3RSIM15               :1;
    };
} COG3RSIM1bits_t;
extern volatile COG3RSIM1bits_t COG3RSIM1bits __at(0x818);
// bitfield macros
#define _COG3RSIM1_RSIM9_POSN                               0x1
#define _COG3RSIM1_RSIM9_POSITION                           0x1
#define _COG3RSIM1_RSIM9_SIZE                               0x1
#define _COG3RSIM1_RSIM9_LENGTH                             0x1
#define _COG3RSIM1_RSIM9_MASK                               0x2
#define _COG3RSIM1_RSIM11_POSN                              0x3
#define _COG3RSIM1_RSIM11_POSITION                          0x3
#define _COG3RSIM1_RSIM11_SIZE                              0x1
#define _COG3RSIM1_RSIM11_LENGTH                            0x1
#define _COG3RSIM1_RSIM11_MASK                              0x8
#define _COG3RSIM1_RSIM12_POSN                              0x4
#define _COG3RSIM1_RSIM12_POSITION                          0x4
#define _COG3RSIM1_RSIM12_SIZE                              0x1
#define _COG3RSIM1_RSIM12_LENGTH                            0x1
#define _COG3RSIM1_RSIM12_MASK                              0x10
#define _COG3RSIM1_RSIM13_POSN                              0x5
#define _COG3RSIM1_RSIM13_POSITION                          0x5
#define _COG3RSIM1_RSIM13_SIZE                              0x1
#define _COG3RSIM1_RSIM13_LENGTH                            0x1
#define _COG3RSIM1_RSIM13_MASK                              0x20
#define _COG3RSIM1_RSIM14_POSN                              0x6
#define _COG3RSIM1_RSIM14_POSITION                          0x6
#define _COG3RSIM1_RSIM14_SIZE                              0x1
#define _COG3RSIM1_RSIM14_LENGTH                            0x1
#define _COG3RSIM1_RSIM14_MASK                              0x40
#define _COG3RSIM1_RSIM15_POSN                              0x7
#define _COG3RSIM1_RSIM15_POSITION                          0x7
#define _COG3RSIM1_RSIM15_SIZE                              0x1
#define _COG3RSIM1_RSIM15_LENGTH                            0x1
#define _COG3RSIM1_RSIM15_MASK                              0x80
#define _COG3RSIM1_G3RSIM9_POSN                             0x1
#define _COG3RSIM1_G3RSIM9_POSITION                         0x1
#define _COG3RSIM1_G3RSIM9_SIZE                             0x1
#define _COG3RSIM1_G3RSIM9_LENGTH                           0x1
#define _COG3RSIM1_G3RSIM9_MASK                             0x2
#define _COG3RSIM1_G3RSIM11_POSN                            0x3
#define _COG3RSIM1_G3RSIM11_POSITION                        0x3
#define _COG3RSIM1_G3RSIM11_SIZE                            0x1
#define _COG3RSIM1_G3RSIM11_LENGTH                          0x1
#define _COG3RSIM1_G3RSIM11_MASK                            0x8
#define _COG3RSIM1_G3RSIM12_POSN                            0x4
#define _COG3RSIM1_G3RSIM12_POSITION                        0x4
#define _COG3RSIM1_G3RSIM12_SIZE                            0x1
#define _COG3RSIM1_G3RSIM12_LENGTH                          0x1
#define _COG3RSIM1_G3RSIM12_MASK                            0x10
#define _COG3RSIM1_G3RSIM13_POSN                            0x5
#define _COG3RSIM1_G3RSIM13_POSITION                        0x5
#define _COG3RSIM1_G3RSIM13_SIZE                            0x1
#define _COG3RSIM1_G3RSIM13_LENGTH                          0x1
#define _COG3RSIM1_G3RSIM13_MASK                            0x20
#define _COG3RSIM1_G3RSIM14_POSN                            0x6
#define _COG3RSIM1_G3RSIM14_POSITION                        0x6
#define _COG3RSIM1_G3RSIM14_SIZE                            0x1
#define _COG3RSIM1_G3RSIM14_LENGTH                          0x1
#define _COG3RSIM1_G3RSIM14_MASK                            0x40
#define _COG3RSIM1_G3RSIM15_POSN                            0x7
#define _COG3RSIM1_G3RSIM15_POSITION                        0x7
#define _COG3RSIM1_G3RSIM15_SIZE                            0x1
#define _COG3RSIM1_G3RSIM15_LENGTH                          0x1
#define _COG3RSIM1_G3RSIM15_MASK                            0x80

// Register: COG3FIS0
#define COG3FIS0 COG3FIS0
extern volatile unsigned char           COG3FIS0            __at(0x819);
#ifndef _LIB_BUILD
asm("COG3FIS0 equ 0819h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FIS0                   :1;
        unsigned FIS1                   :1;
        unsigned FIS2                   :1;
        unsigned FIS3                   :1;
        unsigned FIS4                   :1;
        unsigned FIS5                   :1;
        unsigned FIS6                   :1;
        unsigned FIS7                   :1;
    };
    struct {
        unsigned G3FIS0                 :1;
        unsigned G3FIS1                 :1;
        unsigned G3FIS2                 :1;
        unsigned G3FIS3                 :1;
        unsigned G3FIS4                 :1;
        unsigned G3FIS5                 :1;
        unsigned G3FIS6                 :1;
        unsigned G3FIS7                 :1;
    };
} COG3FIS0bits_t;
extern volatile COG3FIS0bits_t COG3FIS0bits __at(0x819);
// bitfield macros
#define _COG3FIS0_FIS0_POSN                                 0x0
#define _COG3FIS0_FIS0_POSITION                             0x0
#define _COG3FIS0_FIS0_SIZE                                 0x1
#define _COG3FIS0_FIS0_LENGTH                               0x1
#define _COG3FIS0_FIS0_MASK                                 0x1
#define _COG3FIS0_FIS1_POSN                                 0x1
#define _COG3FIS0_FIS1_POSITION                             0x1
#define _COG3FIS0_FIS1_SIZE                                 0x1
#define _COG3FIS0_FIS1_LENGTH                               0x1
#define _COG3FIS0_FIS1_MASK                                 0x2
#define _COG3FIS0_FIS2_POSN                                 0x2
#define _COG3FIS0_FIS2_POSITION                             0x2
#define _COG3FIS0_FIS2_SIZE                                 0x1
#define _COG3FIS0_FIS2_LENGTH                               0x1
#define _COG3FIS0_FIS2_MASK                                 0x4
#define _COG3FIS0_FIS3_POSN                                 0x3
#define _COG3FIS0_FIS3_POSITION                             0x3
#define _COG3FIS0_FIS3_SIZE                                 0x1
#define _COG3FIS0_FIS3_LENGTH                               0x1
#define _COG3FIS0_FIS3_MASK                                 0x8
#define _COG3FIS0_FIS4_POSN                                 0x4
#define _COG3FIS0_FIS4_POSITION                             0x4
#define _COG3FIS0_FIS4_SIZE                                 0x1
#define _COG3FIS0_FIS4_LENGTH                               0x1
#define _COG3FIS0_FIS4_MASK                                 0x10
#define _COG3FIS0_FIS5_POSN                                 0x5
#define _COG3FIS0_FIS5_POSITION                             0x5
#define _COG3FIS0_FIS5_SIZE                                 0x1
#define _COG3FIS0_FIS5_LENGTH                               0x1
#define _COG3FIS0_FIS5_MASK                                 0x20
#define _COG3FIS0_FIS6_POSN                                 0x6
#define _COG3FIS0_FIS6_POSITION                             0x6
#define _COG3FIS0_FIS6_SIZE                                 0x1
#define _COG3FIS0_FIS6_LENGTH                               0x1
#define _COG3FIS0_FIS6_MASK                                 0x40
#define _COG3FIS0_FIS7_POSN                                 0x7
#define _COG3FIS0_FIS7_POSITION                             0x7
#define _COG3FIS0_FIS7_SIZE                                 0x1
#define _COG3FIS0_FIS7_LENGTH                               0x1
#define _COG3FIS0_FIS7_MASK                                 0x80
#define _COG3FIS0_G3FIS0_POSN                               0x0
#define _COG3FIS0_G3FIS0_POSITION                           0x0
#define _COG3FIS0_G3FIS0_SIZE                               0x1
#define _COG3FIS0_G3FIS0_LENGTH                             0x1
#define _COG3FIS0_G3FIS0_MASK                               0x1
#define _COG3FIS0_G3FIS1_POSN                               0x1
#define _COG3FIS0_G3FIS1_POSITION                           0x1
#define _COG3FIS0_G3FIS1_SIZE                               0x1
#define _COG3FIS0_G3FIS1_LENGTH                             0x1
#define _COG3FIS0_G3FIS1_MASK                               0x2
#define _COG3FIS0_G3FIS2_POSN                               0x2
#define _COG3FIS0_G3FIS2_POSITION                           0x2
#define _COG3FIS0_G3FIS2_SIZE                               0x1
#define _COG3FIS0_G3FIS2_LENGTH                             0x1
#define _COG3FIS0_G3FIS2_MASK                               0x4
#define _COG3FIS0_G3FIS3_POSN                               0x3
#define _COG3FIS0_G3FIS3_POSITION                           0x3
#define _COG3FIS0_G3FIS3_SIZE                               0x1
#define _COG3FIS0_G3FIS3_LENGTH                             0x1
#define _COG3FIS0_G3FIS3_MASK                               0x8
#define _COG3FIS0_G3FIS4_POSN                               0x4
#define _COG3FIS0_G3FIS4_POSITION                           0x4
#define _COG3FIS0_G3FIS4_SIZE                               0x1
#define _COG3FIS0_G3FIS4_LENGTH                             0x1
#define _COG3FIS0_G3FIS4_MASK                               0x10
#define _COG3FIS0_G3FIS5_POSN                               0x5
#define _COG3FIS0_G3FIS5_POSITION                           0x5
#define _COG3FIS0_G3FIS5_SIZE                               0x1
#define _COG3FIS0_G3FIS5_LENGTH                             0x1
#define _COG3FIS0_G3FIS5_MASK                               0x20
#define _COG3FIS0_G3FIS6_POSN                               0x6
#define _COG3FIS0_G3FIS6_POSITION                           0x6
#define _COG3FIS0_G3FIS6_SIZE                               0x1
#define _COG3FIS0_G3FIS6_LENGTH                             0x1
#define _COG3FIS0_G3FIS6_MASK                               0x40
#define _COG3FIS0_G3FIS7_POSN                               0x7
#define _COG3FIS0_G3FIS7_POSITION                           0x7
#define _COG3FIS0_G3FIS7_SIZE                               0x1
#define _COG3FIS0_G3FIS7_LENGTH                             0x1
#define _COG3FIS0_G3FIS7_MASK                               0x80

// Register: COG3FIS1
#define COG3FIS1 COG3FIS1
extern volatile unsigned char           COG3FIS1            __at(0x81A);
#ifndef _LIB_BUILD
asm("COG3FIS1 equ 081Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned FIS9                   :1;
        unsigned                        :1;
        unsigned FIS11                  :1;
        unsigned FIS12                  :1;
        unsigned FIS13                  :1;
        unsigned FIS14                  :1;
        unsigned FIS15                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned G3FIS9                 :1;
        unsigned                        :1;
        unsigned G3FIS11                :1;
        unsigned G3FIS12                :1;
        unsigned G3FIS13                :1;
        unsigned G3FIS14                :1;
        unsigned G3FIS15                :1;
    };
} COG3FIS1bits_t;
