MikroElektronika/core_packages/PIC/XC8/def/PIC16F1773/mcu.h
extern volatile PWM5PHLbits_t PWM5PHLbits __at(0xD91);
// bitfield macros
#define _PWM5PHL_PH_POSN                                    0x0
#define _PWM5PHL_PH_POSITION                                0x0
#define _PWM5PHL_PH_SIZE                                    0x8
#define _PWM5PHL_PH_LENGTH                                  0x8
#define _PWM5PHL_PH_MASK                                    0xFF
#define _PWM5PHL_PWM5PHL0_POSN                              0x0
#define _PWM5PHL_PWM5PHL0_POSITION                          0x0
#define _PWM5PHL_PWM5PHL0_SIZE                              0x1
#define _PWM5PHL_PWM5PHL0_LENGTH                            0x1
#define _PWM5PHL_PWM5PHL0_MASK                              0x1
#define _PWM5PHL_PWM5PHL1_POSN                              0x1
#define _PWM5PHL_PWM5PHL1_POSITION                          0x1
#define _PWM5PHL_PWM5PHL1_SIZE                              0x1
#define _PWM5PHL_PWM5PHL1_LENGTH                            0x1
#define _PWM5PHL_PWM5PHL1_MASK                              0x2
#define _PWM5PHL_PWM5PHL2_POSN                              0x2
#define _PWM5PHL_PWM5PHL2_POSITION                          0x2
#define _PWM5PHL_PWM5PHL2_SIZE                              0x1
#define _PWM5PHL_PWM5PHL2_LENGTH                            0x1
#define _PWM5PHL_PWM5PHL2_MASK                              0x4
#define _PWM5PHL_PWM5PHL3_POSN                              0x3
#define _PWM5PHL_PWM5PHL3_POSITION                          0x3
#define _PWM5PHL_PWM5PHL3_SIZE                              0x1
#define _PWM5PHL_PWM5PHL3_LENGTH                            0x1
#define _PWM5PHL_PWM5PHL3_MASK                              0x8
#define _PWM5PHL_PWM5PHL4_POSN                              0x4
#define _PWM5PHL_PWM5PHL4_POSITION                          0x4
#define _PWM5PHL_PWM5PHL4_SIZE                              0x1
#define _PWM5PHL_PWM5PHL4_LENGTH                            0x1
#define _PWM5PHL_PWM5PHL4_MASK                              0x10
#define _PWM5PHL_PWM5PHL5_POSN                              0x5
#define _PWM5PHL_PWM5PHL5_POSITION                          0x5
#define _PWM5PHL_PWM5PHL5_SIZE                              0x1
#define _PWM5PHL_PWM5PHL5_LENGTH                            0x1
#define _PWM5PHL_PWM5PHL5_MASK                              0x20
#define _PWM5PHL_PWM5PHL6_POSN                              0x6
#define _PWM5PHL_PWM5PHL6_POSITION                          0x6
#define _PWM5PHL_PWM5PHL6_SIZE                              0x1
#define _PWM5PHL_PWM5PHL6_LENGTH                            0x1
#define _PWM5PHL_PWM5PHL6_MASK                              0x40
#define _PWM5PHL_PWM5PHL7_POSN                              0x7
#define _PWM5PHL_PWM5PHL7_POSITION                          0x7
#define _PWM5PHL_PWM5PHL7_SIZE                              0x1
#define _PWM5PHL_PWM5PHL7_LENGTH                            0x1
#define _PWM5PHL_PWM5PHL7_MASK                              0x80
#define _PWM5PHL_PWM5PHL_POSN                               0x0
#define _PWM5PHL_PWM5PHL_POSITION                           0x0
#define _PWM5PHL_PWM5PHL_SIZE                               0x8
#define _PWM5PHL_PWM5PHL_LENGTH                             0x8
#define _PWM5PHL_PWM5PHL_MASK                               0xFF

// Register: PWM5PHH
#define PWM5PHH PWM5PHH
extern volatile unsigned char           PWM5PHH             __at(0xD92);
#ifndef _LIB_BUILD
asm("PWM5PHH equ 0D92h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PH                     :8;
    };
    struct {
        unsigned PWM5PHH0               :1;
        unsigned PWM5PHH1               :1;
        unsigned PWM5PHH2               :1;
        unsigned PWM5PHH3               :1;
        unsigned PWM5PHH4               :1;
        unsigned PWM5PHH5               :1;
        unsigned PWM5PHH6               :1;
        unsigned PWM5PHH7               :1;
    };
    struct {
        unsigned PWM5PHH                :8;
    };
} PWM5PHHbits_t;
extern volatile PWM5PHHbits_t PWM5PHHbits __at(0xD92);
// bitfield macros
#define _PWM5PHH_PH_POSN                                    0x0
#define _PWM5PHH_PH_POSITION                                0x0
#define _PWM5PHH_PH_SIZE                                    0x8
#define _PWM5PHH_PH_LENGTH                                  0x8
#define _PWM5PHH_PH_MASK                                    0xFF
#define _PWM5PHH_PWM5PHH0_POSN                              0x0
#define _PWM5PHH_PWM5PHH0_POSITION                          0x0
#define _PWM5PHH_PWM5PHH0_SIZE                              0x1
#define _PWM5PHH_PWM5PHH0_LENGTH                            0x1
#define _PWM5PHH_PWM5PHH0_MASK                              0x1
#define _PWM5PHH_PWM5PHH1_POSN                              0x1
#define _PWM5PHH_PWM5PHH1_POSITION                          0x1
#define _PWM5PHH_PWM5PHH1_SIZE                              0x1
#define _PWM5PHH_PWM5PHH1_LENGTH                            0x1
#define _PWM5PHH_PWM5PHH1_MASK                              0x2
#define _PWM5PHH_PWM5PHH2_POSN                              0x2
#define _PWM5PHH_PWM5PHH2_POSITION                          0x2
#define _PWM5PHH_PWM5PHH2_SIZE                              0x1
#define _PWM5PHH_PWM5PHH2_LENGTH                            0x1
#define _PWM5PHH_PWM5PHH2_MASK                              0x4
#define _PWM5PHH_PWM5PHH3_POSN                              0x3
#define _PWM5PHH_PWM5PHH3_POSITION                          0x3
#define _PWM5PHH_PWM5PHH3_SIZE                              0x1
#define _PWM5PHH_PWM5PHH3_LENGTH                            0x1
#define _PWM5PHH_PWM5PHH3_MASK                              0x8
#define _PWM5PHH_PWM5PHH4_POSN                              0x4
#define _PWM5PHH_PWM5PHH4_POSITION                          0x4
#define _PWM5PHH_PWM5PHH4_SIZE                              0x1
#define _PWM5PHH_PWM5PHH4_LENGTH                            0x1
#define _PWM5PHH_PWM5PHH4_MASK                              0x10
#define _PWM5PHH_PWM5PHH5_POSN                              0x5
#define _PWM5PHH_PWM5PHH5_POSITION                          0x5
#define _PWM5PHH_PWM5PHH5_SIZE                              0x1
#define _PWM5PHH_PWM5PHH5_LENGTH                            0x1
#define _PWM5PHH_PWM5PHH5_MASK                              0x20
#define _PWM5PHH_PWM5PHH6_POSN                              0x6
#define _PWM5PHH_PWM5PHH6_POSITION                          0x6
#define _PWM5PHH_PWM5PHH6_SIZE                              0x1
#define _PWM5PHH_PWM5PHH6_LENGTH                            0x1
#define _PWM5PHH_PWM5PHH6_MASK                              0x40
#define _PWM5PHH_PWM5PHH7_POSN                              0x7
#define _PWM5PHH_PWM5PHH7_POSITION                          0x7
#define _PWM5PHH_PWM5PHH7_SIZE                              0x1
#define _PWM5PHH_PWM5PHH7_LENGTH                            0x1
#define _PWM5PHH_PWM5PHH7_MASK                              0x80
#define _PWM5PHH_PWM5PHH_POSN                               0x0
#define _PWM5PHH_PWM5PHH_POSITION                           0x0
#define _PWM5PHH_PWM5PHH_SIZE                               0x8
#define _PWM5PHH_PWM5PHH_LENGTH                             0x8
#define _PWM5PHH_PWM5PHH_MASK                               0xFF

