MikroElektronika/core_packages/PIC/XC8/def/PIC16F1773/mcu.h
#define                                 DAC1PSS1_bit        _BIT_ACCESS(DAC1CON0,3)
// DAC1REFL<DAC1R0>
extern volatile __bit                   DAC1R0              __at(0x2C78);	// @ (0x58F * 8 + 0)
#define                                 DAC1R0_bit          _BIT_ACCESS(DAC1REFL,0)
// DAC1REFL<DAC1R1>
extern volatile __bit                   DAC1R1              __at(0x2C79);	// @ (0x58F * 8 + 1)
#define                                 DAC1R1_bit          _BIT_ACCESS(DAC1REFL,1)
// DAC1REFH<DAC1R10>
extern volatile __bit                   DAC1R10             __at(0x2C82);	// @ (0x590 * 8 + 2)
#define                                 DAC1R10_bit         _BIT_ACCESS(DAC1REFH,2)
// DAC1REFH<DAC1R11>
extern volatile __bit                   DAC1R11             __at(0x2C83);	// @ (0x590 * 8 + 3)
#define                                 DAC1R11_bit         _BIT_ACCESS(DAC1REFH,3)
// DAC1REFH<DAC1R12>
extern volatile __bit                   DAC1R12             __at(0x2C84);	// @ (0x590 * 8 + 4)
#define                                 DAC1R12_bit         _BIT_ACCESS(DAC1REFH,4)
// DAC1REFH<DAC1R13>
extern volatile __bit                   DAC1R13             __at(0x2C85);	// @ (0x590 * 8 + 5)
#define                                 DAC1R13_bit         _BIT_ACCESS(DAC1REFH,5)
// DAC1REFH<DAC1R14>
extern volatile __bit                   DAC1R14             __at(0x2C86);	// @ (0x590 * 8 + 6)
#define                                 DAC1R14_bit         _BIT_ACCESS(DAC1REFH,6)
// DAC1REFH<DAC1R15>
extern volatile __bit                   DAC1R15             __at(0x2C87);	// @ (0x590 * 8 + 7)
#define                                 DAC1R15_bit         _BIT_ACCESS(DAC1REFH,7)
// DAC1REFL<DAC1R2>
extern volatile __bit                   DAC1R2              __at(0x2C7A);	// @ (0x58F * 8 + 2)
#define                                 DAC1R2_bit          _BIT_ACCESS(DAC1REFL,2)
// DAC1REFL<DAC1R3>
extern volatile __bit                   DAC1R3              __at(0x2C7B);	// @ (0x58F * 8 + 3)
#define                                 DAC1R3_bit          _BIT_ACCESS(DAC1REFL,3)
// DAC1REFL<DAC1R4>
extern volatile __bit                   DAC1R4              __at(0x2C7C);	// @ (0x58F * 8 + 4)
#define                                 DAC1R4_bit          _BIT_ACCESS(DAC1REFL,4)
// DAC1REFL<DAC1R5>
extern volatile __bit                   DAC1R5              __at(0x2C7D);	// @ (0x58F * 8 + 5)
#define                                 DAC1R5_bit          _BIT_ACCESS(DAC1REFL,5)
// DAC1REFL<DAC1R6>
extern volatile __bit                   DAC1R6              __at(0x2C7E);	// @ (0x58F * 8 + 6)
#define                                 DAC1R6_bit          _BIT_ACCESS(DAC1REFL,6)
// DAC1REFL<DAC1R7>
extern volatile __bit                   DAC1R7              __at(0x2C7F);	// @ (0x58F * 8 + 7)
#define                                 DAC1R7_bit          _BIT_ACCESS(DAC1REFL,7)
// DAC1REFH<DAC1R8>
extern volatile __bit                   DAC1R8              __at(0x2C80);	// @ (0x590 * 8 + 0)
#define                                 DAC1R8_bit          _BIT_ACCESS(DAC1REFH,0)
// DAC1REFH<DAC1R9>
extern volatile __bit                   DAC1R9              __at(0x2C81);	// @ (0x590 * 8 + 1)
#define                                 DAC1R9_bit          _BIT_ACCESS(DAC1REFH,1)
// DAC1REFL<DAC1REF0>
extern volatile __bit                   DAC1REF0            __at(0x2C78);	// @ (0x58F * 8 + 0)
#define                                 DAC1REF0_bit        _BIT_ACCESS(DAC1REFL,0)
// DAC1REFL<DAC1REF1>
extern volatile __bit                   DAC1REF1            __at(0x2C79);	// @ (0x58F * 8 + 1)
#define                                 DAC1REF1_bit        _BIT_ACCESS(DAC1REFL,1)
// DAC1REFH<DAC1REF10>
extern volatile __bit                   DAC1REF10           __at(0x2C82);	// @ (0x590 * 8 + 2)
#define                                 DAC1REF10_bit       _BIT_ACCESS(DAC1REFH,2)
// DAC1REFH<DAC1REF11>
extern volatile __bit                   DAC1REF11           __at(0x2C83);	// @ (0x590 * 8 + 3)
#define                                 DAC1REF11_bit       _BIT_ACCESS(DAC1REFH,3)
// DAC1REFH<DAC1REF12>
extern volatile __bit                   DAC1REF12           __at(0x2C84);	// @ (0x590 * 8 + 4)
#define                                 DAC1REF12_bit       _BIT_ACCESS(DAC1REFH,4)
// DAC1REFH<DAC1REF13>
extern volatile __bit                   DAC1REF13           __at(0x2C85);	// @ (0x590 * 8 + 5)
#define                                 DAC1REF13_bit       _BIT_ACCESS(DAC1REFH,5)
// DAC1REFH<DAC1REF14>
extern volatile __bit                   DAC1REF14           __at(0x2C86);	// @ (0x590 * 8 + 6)
#define                                 DAC1REF14_bit       _BIT_ACCESS(DAC1REFH,6)
// DAC1REFH<DAC1REF15>
extern volatile __bit                   DAC1REF15           __at(0x2C87);	// @ (0x590 * 8 + 7)
#define                                 DAC1REF15_bit       _BIT_ACCESS(DAC1REFH,7)
// DAC1REFL<DAC1REF2>
extern volatile __bit                   DAC1REF2            __at(0x2C7A);	// @ (0x58F * 8 + 2)
#define                                 DAC1REF2_bit        _BIT_ACCESS(DAC1REFL,2)
// DAC1REFL<DAC1REF3>
extern volatile __bit                   DAC1REF3            __at(0x2C7B);	// @ (0x58F * 8 + 3)
#define                                 DAC1REF3_bit        _BIT_ACCESS(DAC1REFL,3)
// DAC1REFL<DAC1REF4>
extern volatile __bit                   DAC1REF4            __at(0x2C7C);	// @ (0x58F * 8 + 4)
#define                                 DAC1REF4_bit        _BIT_ACCESS(DAC1REFL,4)
// DAC1REFL<DAC1REF5>
extern volatile __bit                   DAC1REF5            __at(0x2C7D);	// @ (0x58F * 8 + 5)
#define                                 DAC1REF5_bit        _BIT_ACCESS(DAC1REFL,5)
// DAC1REFL<DAC1REF6>
extern volatile __bit                   DAC1REF6            __at(0x2C7E);	// @ (0x58F * 8 + 6)
#define                                 DAC1REF6_bit        _BIT_ACCESS(DAC1REFL,6)
// DAC1REFL<DAC1REF7>
extern volatile __bit                   DAC1REF7            __at(0x2C7F);	// @ (0x58F * 8 + 7)
#define                                 DAC1REF7_bit        _BIT_ACCESS(DAC1REFL,7)
// DAC1REFH<DAC1REF8>
extern volatile __bit                   DAC1REF8            __at(0x2C80);	// @ (0x590 * 8 + 0)
#define                                 DAC1REF8_bit        _BIT_ACCESS(DAC1REFH,0)
// DAC1REFH<DAC1REF9>
extern volatile __bit                   DAC1REF9            __at(0x2C81);	// @ (0x590 * 8 + 1)
#define                                 DAC1REF9_bit        _BIT_ACCESS(DAC1REFH,1)
// DAC2CON0<DAC2EN>
extern volatile __bit                   DAC2EN              __at(0x2C8F);	// @ (0x591 * 8 + 7)
#define                                 DAC2EN_bit          _BIT_ACCESS(DAC2CON0,7)
// DAC2CON0<DAC2FM>
extern volatile __bit                   DAC2FM              __at(0x2C8E);	// @ (0x591 * 8 + 6)
#define                                 DAC2FM_bit          _BIT_ACCESS(DAC2CON0,6)
// DACLD<DAC2LD>
extern volatile __bit                   DAC2LD              __at(0x2C69);	// @ (0x58D * 8 + 1)
#define                                 DAC2LD_bit          _BIT_ACCESS(DACLD,1)
// DAC2CON0<DAC2NSS0>
extern volatile __bit                   DAC2NSS0            __at(0x2C88);	// @ (0x591 * 8 + 0)
#define                                 DAC2NSS0_bit        _BIT_ACCESS(DAC2CON0,0)
// DAC2CON0<DAC2NSS1>
extern volatile __bit                   DAC2NSS1            __at(0x2C89);	// @ (0x591 * 8 + 1)
#define                                 DAC2NSS1_bit        _BIT_ACCESS(DAC2CON0,1)
// DAC2CON0<DAC2OE1>
extern volatile __bit                   DAC2OE1             __at(0x2C8D);	// @ (0x591 * 8 + 5)
#define                                 DAC2OE1_bit         _BIT_ACCESS(DAC2CON0,5)
// DAC2CON0<DAC2OE2>
extern volatile __bit                   DAC2OE2             __at(0x2C8C);	// @ (0x591 * 8 + 4)
#define                                 DAC2OE2_bit         _BIT_ACCESS(DAC2CON0,4)
// DAC2CON0<DAC2PSS0>
extern volatile __bit                   DAC2PSS0            __at(0x2C8A);	// @ (0x591 * 8 + 2)
#define                                 DAC2PSS0_bit        _BIT_ACCESS(DAC2CON0,2)
// DAC2CON0<DAC2PSS1>
extern volatile __bit                   DAC2PSS1            __at(0x2C8B);	// @ (0x591 * 8 + 3)
#define                                 DAC2PSS1_bit        _BIT_ACCESS(DAC2CON0,3)
// DAC2REFL<DAC2R0>
extern volatile __bit                   DAC2R0              __at(0x2C90);	// @ (0x592 * 8 + 0)
#define                                 DAC2R0_bit          _BIT_ACCESS(DAC2REFL,0)
// DAC2REFL<DAC2R1>
extern volatile __bit                   DAC2R1              __at(0x2C91);	// @ (0x592 * 8 + 1)
#define                                 DAC2R1_bit          _BIT_ACCESS(DAC2REFL,1)
// DAC2REFH<DAC2R10>
extern volatile __bit                   DAC2R10             __at(0x2C9A);	// @ (0x593 * 8 + 2)
#define                                 DAC2R10_bit         _BIT_ACCESS(DAC2REFH,2)
// DAC2REFH<DAC2R11>
extern volatile __bit                   DAC2R11             __at(0x2C9B);	// @ (0x593 * 8 + 3)
#define                                 DAC2R11_bit         _BIT_ACCESS(DAC2REFH,3)
// DAC2REFH<DAC2R12>
extern volatile __bit                   DAC2R12             __at(0x2C9C);	// @ (0x593 * 8 + 4)
#define                                 DAC2R12_bit         _BIT_ACCESS(DAC2REFH,4)
// DAC2REFH<DAC2R13>
extern volatile __bit                   DAC2R13             __at(0x2C9D);	// @ (0x593 * 8 + 5)
#define                                 DAC2R13_bit         _BIT_ACCESS(DAC2REFH,5)
// DAC2REFH<DAC2R14>
extern volatile __bit                   DAC2R14             __at(0x2C9E);	// @ (0x593 * 8 + 6)
#define                                 DAC2R14_bit         _BIT_ACCESS(DAC2REFH,6)
// DAC2REFH<DAC2R15>
extern volatile __bit                   DAC2R15             __at(0x2C9F);	// @ (0x593 * 8 + 7)
#define                                 DAC2R15_bit         _BIT_ACCESS(DAC2REFH,7)
// DAC2REFL<DAC2R2>
extern volatile __bit                   DAC2R2              __at(0x2C92);	// @ (0x592 * 8 + 2)
#define                                 DAC2R2_bit          _BIT_ACCESS(DAC2REFL,2)
// DAC2REFL<DAC2R3>
extern volatile __bit                   DAC2R3              __at(0x2C93);	// @ (0x592 * 8 + 3)
#define                                 DAC2R3_bit          _BIT_ACCESS(DAC2REFL,3)
// DAC2REFL<DAC2R4>
extern volatile __bit                   DAC2R4              __at(0x2C94);	// @ (0x592 * 8 + 4)
#define                                 DAC2R4_bit          _BIT_ACCESS(DAC2REFL,4)
// DAC2REFL<DAC2R5>
extern volatile __bit                   DAC2R5              __at(0x2C95);	// @ (0x592 * 8 + 5)
#define                                 DAC2R5_bit          _BIT_ACCESS(DAC2REFL,5)
// DAC2REFL<DAC2R6>
extern volatile __bit                   DAC2R6              __at(0x2C96);	// @ (0x592 * 8 + 6)
#define                                 DAC2R6_bit          _BIT_ACCESS(DAC2REFL,6)
// DAC2REFL<DAC2R7>
extern volatile __bit                   DAC2R7              __at(0x2C97);	// @ (0x592 * 8 + 7)
#define                                 DAC2R7_bit          _BIT_ACCESS(DAC2REFL,7)
// DAC2REFH<DAC2R8>
extern volatile __bit                   DAC2R8              __at(0x2C98);	// @ (0x593 * 8 + 0)
#define                                 DAC2R8_bit          _BIT_ACCESS(DAC2REFH,0)
// DAC2REFH<DAC2R9>
extern volatile __bit                   DAC2R9              __at(0x2C99);	// @ (0x593 * 8 + 1)
#define                                 DAC2R9_bit          _BIT_ACCESS(DAC2REFH,1)
// DAC2REFL<DAC2REF0>
extern volatile __bit                   DAC2REF0            __at(0x2C90);	// @ (0x592 * 8 + 0)
#define                                 DAC2REF0_bit        _BIT_ACCESS(DAC2REFL,0)
// DAC2REFL<DAC2REF1>
extern volatile __bit                   DAC2REF1            __at(0x2C91);	// @ (0x592 * 8 + 1)
#define                                 DAC2REF1_bit        _BIT_ACCESS(DAC2REFL,1)
// DAC2REFH<DAC2REF10>
extern volatile __bit                   DAC2REF10           __at(0x2C9A);	// @ (0x593 * 8 + 2)
#define                                 DAC2REF10_bit       _BIT_ACCESS(DAC2REFH,2)
// DAC2REFH<DAC2REF11>
extern volatile __bit                   DAC2REF11           __at(0x2C9B);	// @ (0x593 * 8 + 3)
#define                                 DAC2REF11_bit       _BIT_ACCESS(DAC2REFH,3)
// DAC2REFH<DAC2REF12>
extern volatile __bit                   DAC2REF12           __at(0x2C9C);	// @ (0x593 * 8 + 4)
#define                                 DAC2REF12_bit       _BIT_ACCESS(DAC2REFH,4)
// DAC2REFH<DAC2REF13>
extern volatile __bit                   DAC2REF13           __at(0x2C9D);	// @ (0x593 * 8 + 5)
#define                                 DAC2REF13_bit       _BIT_ACCESS(DAC2REFH,5)
// DAC2REFH<DAC2REF14>
extern volatile __bit                   DAC2REF14           __at(0x2C9E);	// @ (0x593 * 8 + 6)
#define                                 DAC2REF14_bit       _BIT_ACCESS(DAC2REFH,6)
// DAC2REFH<DAC2REF15>
extern volatile __bit                   DAC2REF15           __at(0x2C9F);	// @ (0x593 * 8 + 7)
#define                                 DAC2REF15_bit       _BIT_ACCESS(DAC2REFH,7)
// DAC2REFL<DAC2REF2>
extern volatile __bit                   DAC2REF2            __at(0x2C92);	// @ (0x592 * 8 + 2)
#define                                 DAC2REF2_bit        _BIT_ACCESS(DAC2REFL,2)
// DAC2REFL<DAC2REF3>
extern volatile __bit                   DAC2REF3            __at(0x2C93);	// @ (0x592 * 8 + 3)
#define                                 DAC2REF3_bit        _BIT_ACCESS(DAC2REFL,3)
// DAC2REFL<DAC2REF4>
extern volatile __bit                   DAC2REF4            __at(0x2C94);	// @ (0x592 * 8 + 4)
#define                                 DAC2REF4_bit        _BIT_ACCESS(DAC2REFL,4)
// DAC2REFL<DAC2REF5>
extern volatile __bit                   DAC2REF5            __at(0x2C95);	// @ (0x592 * 8 + 5)
#define                                 DAC2REF5_bit        _BIT_ACCESS(DAC2REFL,5)
// DAC2REFL<DAC2REF6>
extern volatile __bit                   DAC2REF6            __at(0x2C96);	// @ (0x592 * 8 + 6)
#define                                 DAC2REF6_bit        _BIT_ACCESS(DAC2REFL,6)
// DAC2REFL<DAC2REF7>
extern volatile __bit                   DAC2REF7            __at(0x2C97);	// @ (0x592 * 8 + 7)
#define                                 DAC2REF7_bit        _BIT_ACCESS(DAC2REFL,7)
// DAC2REFH<DAC2REF8>
extern volatile __bit                   DAC2REF8            __at(0x2C98);	// @ (0x593 * 8 + 0)
#define                                 DAC2REF8_bit        _BIT_ACCESS(DAC2REFH,0)
// DAC2REFH<DAC2REF9>
extern volatile __bit                   DAC2REF9            __at(0x2C99);	// @ (0x593 * 8 + 1)
#define                                 DAC2REF9_bit        _BIT_ACCESS(DAC2REFH,1)
// DAC3CON0<DAC3EN>
extern volatile __bit                   DAC3EN              __at(0x2CA7);	// @ (0x594 * 8 + 7)
#define                                 DAC3EN_bit          _BIT_ACCESS(DAC3CON0,7)
// DAC3CON0<DAC3NSS0>
extern volatile __bit                   DAC3NSS0            __at(0x2CA0);	// @ (0x594 * 8 + 0)
#define                                 DAC3NSS0_bit        _BIT_ACCESS(DAC3CON0,0)
// DAC3CON0<DAC3NSS1>
extern volatile __bit                   DAC3NSS1            __at(0x2CA1);	// @ (0x594 * 8 + 1)
#define                                 DAC3NSS1_bit        _BIT_ACCESS(DAC3CON0,1)
// DAC3CON0<DAC3OE1>
extern volatile __bit                   DAC3OE1             __at(0x2CA5);	// @ (0x594 * 8 + 5)
#define                                 DAC3OE1_bit         _BIT_ACCESS(DAC3CON0,5)
// DAC3CON0<DAC3OE2>
extern volatile __bit                   DAC3OE2             __at(0x2CA4);	// @ (0x594 * 8 + 4)
#define                                 DAC3OE2_bit         _BIT_ACCESS(DAC3CON0,4)
// DAC3CON0<DAC3PSS0>
extern volatile __bit                   DAC3PSS0            __at(0x2CA2);	// @ (0x594 * 8 + 2)
#define                                 DAC3PSS0_bit        _BIT_ACCESS(DAC3CON0,2)
// DAC3CON0<DAC3PSS1>
extern volatile __bit                   DAC3PSS1            __at(0x2CA3);	// @ (0x594 * 8 + 3)
#define                                 DAC3PSS1_bit        _BIT_ACCESS(DAC3CON0,3)
// DAC3REF<DAC3R0>
extern volatile __bit                   DAC3R0              __at(0x2CA8);	// @ (0x595 * 8 + 0)
#define                                 DAC3R0_bit          _BIT_ACCESS(DAC3REF,0)
// DAC3REF<DAC3R1>
extern volatile __bit                   DAC3R1              __at(0x2CA9);	// @ (0x595 * 8 + 1)
#define                                 DAC3R1_bit          _BIT_ACCESS(DAC3REF,1)
// DAC3REF<DAC3R2>
extern volatile __bit                   DAC3R2              __at(0x2CAA);	// @ (0x595 * 8 + 2)
#define                                 DAC3R2_bit          _BIT_ACCESS(DAC3REF,2)
// DAC3REF<DAC3R3>
extern volatile __bit                   DAC3R3              __at(0x2CAB);	// @ (0x595 * 8 + 3)
#define                                 DAC3R3_bit          _BIT_ACCESS(DAC3REF,3)
// DAC3REF<DAC3R4>
extern volatile __bit                   DAC3R4              __at(0x2CAC);	// @ (0x595 * 8 + 4)
#define                                 DAC3R4_bit          _BIT_ACCESS(DAC3REF,4)
// DAC3REF<DAC3REF0>
extern volatile __bit                   DAC3REF0            __at(0x2CA8);	// @ (0x595 * 8 + 0)
#define                                 DAC3REF0_bit        _BIT_ACCESS(DAC3REF,0)
// DAC3REF<DAC3REF1>
extern volatile __bit                   DAC3REF1            __at(0x2CA9);	// @ (0x595 * 8 + 1)
#define                                 DAC3REF1_bit        _BIT_ACCESS(DAC3REF,1)
// DAC3REF<DAC3REF2>
extern volatile __bit                   DAC3REF2            __at(0x2CAA);	// @ (0x595 * 8 + 2)
#define                                 DAC3REF2_bit        _BIT_ACCESS(DAC3REF,2)
// DAC3REF<DAC3REF3>
extern volatile __bit                   DAC3REF3            __at(0x2CAB);	// @ (0x595 * 8 + 3)
#define                                 DAC3REF3_bit        _BIT_ACCESS(DAC3REF,3)
// DAC3REF<DAC3REF4>
extern volatile __bit                   DAC3REF4            __at(0x2CAC);	// @ (0x595 * 8 + 4)
#define                                 DAC3REF4_bit        _BIT_ACCESS(DAC3REF,4)
// DAC4CON0<DAC4EN>
extern volatile __bit                   DAC4EN              __at(0x2CB7);	// @ (0x596 * 8 + 7)
#define                                 DAC4EN_bit          _BIT_ACCESS(DAC4CON0,7)
// DAC4CON0<DAC4NSS0>
extern volatile __bit                   DAC4NSS0            __at(0x2CB0);	// @ (0x596 * 8 + 0)
#define                                 DAC4NSS0_bit        _BIT_ACCESS(DAC4CON0,0)
// DAC4CON0<DAC4NSS1>
extern volatile __bit                   DAC4NSS1            __at(0x2CB1);	// @ (0x596 * 8 + 1)
#define                                 DAC4NSS1_bit        _BIT_ACCESS(DAC4CON0,1)
// DAC4CON0<DAC4OE1>
extern volatile __bit                   DAC4OE1             __at(0x2CB5);	// @ (0x596 * 8 + 5)
#define                                 DAC4OE1_bit         _BIT_ACCESS(DAC4CON0,5)
// DAC4CON0<DAC4OE2>
extern volatile __bit                   DAC4OE2             __at(0x2CB4);	// @ (0x596 * 8 + 4)
#define                                 DAC4OE2_bit         _BIT_ACCESS(DAC4CON0,4)
// DAC4CON0<DAC4PSS0>
extern volatile __bit                   DAC4PSS0            __at(0x2CB2);	// @ (0x596 * 8 + 2)
#define                                 DAC4PSS0_bit        _BIT_ACCESS(DAC4CON0,2)
// DAC4CON0<DAC4PSS1>
extern volatile __bit                   DAC4PSS1            __at(0x2CB3);	// @ (0x596 * 8 + 3)
#define                                 DAC4PSS1_bit        _BIT_ACCESS(DAC4CON0,3)
// DAC4REF<DAC4R0>
extern volatile __bit                   DAC4R0              __at(0x2CB8);	// @ (0x597 * 8 + 0)
#define                                 DAC4R0_bit          _BIT_ACCESS(DAC4REF,0)
// DAC4REF<DAC4R1>
extern volatile __bit                   DAC4R1              __at(0x2CB9);	// @ (0x597 * 8 + 1)
#define                                 DAC4R1_bit          _BIT_ACCESS(DAC4REF,1)
// DAC4REF<DAC4R2>
extern volatile __bit                   DAC4R2              __at(0x2CBA);	// @ (0x597 * 8 + 2)
#define                                 DAC4R2_bit          _BIT_ACCESS(DAC4REF,2)
// DAC4REF<DAC4R3>
extern volatile __bit                   DAC4R3              __at(0x2CBB);	// @ (0x597 * 8 + 3)
#define                                 DAC4R3_bit          _BIT_ACCESS(DAC4REF,3)
// DAC4REF<DAC4R4>
extern volatile __bit                   DAC4R4              __at(0x2CBC);	// @ (0x597 * 8 + 4)
#define                                 DAC4R4_bit          _BIT_ACCESS(DAC4REF,4)
// DAC4REF<DAC4REF0>
extern volatile __bit                   DAC4REF0            __at(0x2CB8);	// @ (0x597 * 8 + 0)
#define                                 DAC4REF0_bit        _BIT_ACCESS(DAC4REF,0)
// DAC4REF<DAC4REF1>
extern volatile __bit                   DAC4REF1            __at(0x2CB9);	// @ (0x597 * 8 + 1)
#define                                 DAC4REF1_bit        _BIT_ACCESS(DAC4REF,1)
// DAC4REF<DAC4REF2>
extern volatile __bit                   DAC4REF2            __at(0x2CBA);	// @ (0x597 * 8 + 2)
#define                                 DAC4REF2_bit        _BIT_ACCESS(DAC4REF,2)
// DAC4REF<DAC4REF3>
extern volatile __bit                   DAC4REF3            __at(0x2CBB);	// @ (0x597 * 8 + 3)
#define                                 DAC4REF3_bit        _BIT_ACCESS(DAC4REF,3)
// DAC4REF<DAC4REF4>
extern volatile __bit                   DAC4REF4            __at(0x2CBC);	// @ (0x597 * 8 + 4)
#define                                 DAC4REF4_bit        _BIT_ACCESS(DAC4REF,4)
// DAC5CON0<DAC5EN>
extern volatile __bit                   DAC5EN              __at(0x2CC7);	// @ (0x598 * 8 + 7)
#define                                 DAC5EN_bit          _BIT_ACCESS(DAC5CON0,7)
// DAC5CON0<DAC5FM>
extern volatile __bit                   DAC5FM              __at(0x2CC6);	// @ (0x598 * 8 + 6)
#define                                 DAC5FM_bit          _BIT_ACCESS(DAC5CON0,6)
// DACLD<DAC5LD>
extern volatile __bit                   DAC5LD              __at(0x2C6C);	// @ (0x58D * 8 + 4)
#define                                 DAC5LD_bit          _BIT_ACCESS(DACLD,4)
// DAC5CON0<DAC5NSS0>
extern volatile __bit                   DAC5NSS0            __at(0x2CC0);	// @ (0x598 * 8 + 0)
#define                                 DAC5NSS0_bit        _BIT_ACCESS(DAC5CON0,0)
// DAC5CON0<DAC5NSS1>
extern volatile __bit                   DAC5NSS1            __at(0x2CC1);	// @ (0x598 * 8 + 1)
#define                                 DAC5NSS1_bit        _BIT_ACCESS(DAC5CON0,1)
// DAC5CON0<DAC5OE1>
extern volatile __bit                   DAC5OE1             __at(0x2CC5);	// @ (0x598 * 8 + 5)
#define                                 DAC5OE1_bit         _BIT_ACCESS(DAC5CON0,5)
// DAC5CON0<DAC5OE2>
extern volatile __bit                   DAC5OE2             __at(0x2CC4);	// @ (0x598 * 8 + 4)
#define                                 DAC5OE2_bit         _BIT_ACCESS(DAC5CON0,4)
// DAC5CON0<DAC5PSS0>
extern volatile __bit                   DAC5PSS0            __at(0x2CC2);	// @ (0x598 * 8 + 2)
#define                                 DAC5PSS0_bit        _BIT_ACCESS(DAC5CON0,2)
// DAC5CON0<DAC5PSS1>
extern volatile __bit                   DAC5PSS1            __at(0x2CC3);	// @ (0x598 * 8 + 3)
#define                                 DAC5PSS1_bit        _BIT_ACCESS(DAC5CON0,3)
// DAC5REFL<DAC5R0>
extern volatile __bit                   DAC5R0              __at(0x2CC8);	// @ (0x599 * 8 + 0)
#define                                 DAC5R0_bit          _BIT_ACCESS(DAC5REFL,0)
// DAC5REFL<DAC5R1>
extern volatile __bit                   DAC5R1              __at(0x2CC9);	// @ (0x599 * 8 + 1)
#define                                 DAC5R1_bit          _BIT_ACCESS(DAC5REFL,1)
// DAC5REFH<DAC5R10>
extern volatile __bit                   DAC5R10             __at(0x2CD2);	// @ (0x59A * 8 + 2)
#define                                 DAC5R10_bit         _BIT_ACCESS(DAC5REFH,2)
// DAC5REFH<DAC5R11>
extern volatile __bit                   DAC5R11             __at(0x2CD3);	// @ (0x59A * 8 + 3)
